swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/source/ram/hal_dram_init.c
#include "cmsis.h"
#include "rtl8735b_dpi_type.h"
#include "rtl8735b_dramc_type.h"
#include "hal_dram_init.h"
#include "hal_timer.h"
#include "hal_api.h"
#include "hal_sys_ctrl.h"
#include "hal_dram_scan.h"

#define VERBOSE     0
#if defined(VERBOSE) && VERBOSE == 0
#undef DBG_DRAM_INFO
#define DBG_DRAM_INFO(...)
#endif

#define ROUND_UP(divider, divisor) (((divider)%(divisor)) ? (((divider)/(divisor))+1) : ((divider)/(divisor)))

const static unsigned short pll_frequence_table[6][13] = {
	/*{ cco_band,          cco_kvco,         dpi_icp,        dpi_loop_pi_isel,
	    dpi_lpf_cp,        dpi_lpf_sr,       dpi_pdiv,       dpi_pll_ldo_vsel,
	    dp_pll_sel_cpmode, dpi_post_pi_bias, dpi_post_pi_rl, dpi_post_pi_rs,
	    dpi_v11_ldo_vsel}*/
	{3, 1, 3, 2, 1, 3, 0, 0, 1, 0, 3, 0, 0}, //533 MHz
	{1, 1, 3, 1, 1, 3, 0, 0, 1, 0, 2, 0, 0}, //400 MHz
	{1, 1, 3, 1, 1, 3, 0, 0, 1, 0, 2, 0, 0}, //333 MHz
	{0, 0, 3, 0, 1, 3, 0, 0, 1, 0, 2, 0, 0}, //200 MHz
	{3, 0, 3, 1, 1, 3, 0, 0, 1, 0, 3, 0, 0}, //480 MHz
	{3, 1, 3, 2, 1, 3, 0, 0, 1, 0, 3, 0, 0}  //Else
};

struct rxi316_dram_info rxi316_ddr2_dev = {
	DDR_2,
	PAGE_2K,
	BANK_4,
	BST_LEN_8,
	SENQUENTIAL,
	HYBR_256MB,
	DQ_16,
	10  // dram_colu_bits
}; //rxi316_ ddr2_dev

struct rxi316_dram_info rxi316_ddr3_dev = {
	DDR_3,
	PAGE_2K,
	BANK_8,
	BST_LEN_8,
	SENQUENTIAL,
	HYBR_256MB,
	DQ_16,
	10  // dram_colu_bits
}; // rxi316_ddr3_dev

#if CONFIG_PXP || SIMU_DDR_PXP_INIT_FLOW_EN // PXP , asic simu run flow
struct rxi316_dram_mode_reg_info rxi316_ddr2_mode_reg = {
	3,   // dram_wr_lat  //query - WL, CAS = 4
	4,   // dram_rd_lat  //query -RL, CAS = 4
	0,   // dram_add_lat  //query - AL
	0,   // parity_lat
	6,   // 5 or 6 tphy_wd=(DFI_RATIO == 2)? ((wl+1-AC_SHARE) / DFI_RATIO) : (wl  / DFI_RATIO)  //query - wl, CAS = 4
	2,   // tphy_rd=(DFI_RATIO == 2)? ((rl+1-AC_SHARE) / DFI_RATIO) : (rl  / DFI_RATIO)  //query - rl, , CAS = 4
	0,   // without write preamble
	0,   // without write pstamble
	0,   // without read pstamble
	0,   // mode reg 0 or value
	0,   // mode reg 1 or value
	0,   // mode reg 2 or value
	0,   // mode reg 3 or value
	0,   // mode reg 4 or value
	0,   // mode reg 5 or value
	0,   // mode reg 6 or value
	0,   // mode reg 11 or value
	0,   // mode reg 12 or value
	0,   // mode reg 13 or value
	0,   // mode reg 14 or value
	0    // mode reg 22 or value
}; // rxi316_ddr2_mode_reg_1066mhz
#else
struct rxi316_dram_mode_reg_info rxi316_ddr2_mode_reg = {
	6,   // dram_wr_lat  //query - WL, CAS = 7
	7,   // dram_rd_lat  //query -RL, CAS = 7
	0,   // dram_add_lat  //query - AL
	0,   // parity_lat
	8,   // 5 or 6 tphy_wd=(DFI_RATIO == 2)? ((wl+1-AC_SHARE) / DFI_RATIO) : (wl  / DFI_RATIO)  //query - wl, 0629, CAS = 7
	4,   // tphy_rd=(DFI_RATIO == 2)? ((rl+1-AC_SHARE) / DFI_RATIO) : (rl  / DFI_RATIO)  //query - rl, 0629, CAS = 7
	0,   // without write preamble
	0,   // without write pstamble
	0,   // without read pstamble
	0,   // mode reg 0 or value
	0,   // mode reg 1 or value
	0,   // mode reg 2 or value
	0,   // mode reg 3 or value
	0,   // mode reg 4 or value
	0,   // mode reg 5 or value
	0,   // mode reg 6 or value
	0,   // mode reg 11 or value
	0,   // mode reg 12 or value
	0,   // mode reg 13 or value
	0,   // mode reg 14 or value
	0    // mode reg 22 or value
}; // rxi316_ddr2_mode_reg_1066mhz

#endif

struct rxi316_dram_mode_reg_info rxi316_ddr3_mode_reg = {
	6,   // dram_wr_lat
	8,  // dram_rd_lat
	0,   // dram_add_lat
	0,   // parity_lat
	8,   // tphy_wd=(DFI_RATIO == 2)? ((wl+1-AC_SHARE) / DFI_RATIO) : (wl  / DFI_RATIO)
	4,  // tphy_rd=(DFI_RATIO == 2)? ((rl+1-AC_SHARE) / DFI_RATIO) : (rl  / DFI_RATIO)
	0,   // without write preamble
	0,   // without write pstamble
	0,   // without read pstamble
	0,   // mode reg 0 or value
	0,   // mode reg 1 or value
	0,   // mode reg 2 or value
	0,   // mode reg 3 or value
	0,   // mode reg 4 or value
	0,   // mode reg 5 or value
	0,   // mode reg 6 or value
	0,   // mode reg 11 or value
	0,   // mode reg 12 or value
	0,   // mode reg 13 or value
	0,   // mode reg 14 or value
	0    // mode reg 22 or value
}; // rxi316_ddr3_mode_reg_1333mhz

struct rxi316_dram_timing_info rxi316_ddr2_timing = {
	105000,     //trfc_ps; //G0102
	7800000,    // trefi_ps;
	13125,      // trcd_ps; //G0102
	13125,      // trp_ps; //G0102
	45000,      // tras_ps;
	10000,      // trrd_ps;
	15000,      // twr_ps;
	4,          // twtr_tck;  //G0102 - dram_tck
	2,          // tmrd_tck;
	7500,       // trtp_ps;
	2,          // trtp_tck;  //G0102
	2,          // tccd_tck;
	58125,      // trc_ps;  //G0102
	0,          // tccd_s_tck(without tccd_s);
	0,          // twtr_s_tck(without twtr_s);
	0,          // trrd_s_tck(without trrd_s);
	45000,      // tfaw_ps;  //G0102
	11250,       // tcke_ps;  //G0102
	11250,       // txp_ps; //G0102
	325,          // tdqsck_ps;  //G0102
	0,          // tzqcs_tck(without zqc);
	13125,          // trpab_ps(trpab = trppb);  //G0102
	0,          // tppd_tck(without tppd);
	8,          // nWR = 6 (twr_ps/tck_min=15000/1875)  //G0102
	0           // RTP = (((DRAM_BST / 2)-2)/DFI_RATIO) + round_up(TRTP, DRAM_FRQX2)  //G0102 - assigning to 0 as this is calculated inside rxi316_dram_init.c for DDR2 regardless of the value assigned from here
}; // rxi316_ddr2_timing_1066mhz

struct rxi316_dram_timing_info rxi316_ddr3_timing = {  //G0102
	160000,     // trfc_ps;
	7800000,    // trefi_ps;
	13500,      // trcd_ps; //G0102
	13500,      // trp_ps; //G0102
	36000,      // tras_ps; //G0102
	7500,       // trrd_ps;
	15000,      // twr_ps;
	4,          // twtr_tck; //G0102
	4,         // tmrd_tck; //G0102
	7500,       // trtp_ps;
	4,          // trtp_tck;
	4,          // tccd_tck;
	49500,      // trc_ps; //G0102
	0,          // tccd_s_tck(without tccd_s);
	0,          // twtr_s_tck(without twtr_s);
	0,          // trrd_s_tck(without trrd_s);
	45000,      // tfaw_ps; //G0102
	5625,       // tcke_ps; //G0102
	6000,       // txp_ps;
	255,          // tdqsck_ps; //G0102
	64,         // tzqcs_tck;
	0,          // trpab_ps(trpab = trppb);  //G0102 - not used for DDR2,3
	0,          // tppd_tck;  //G0102 - not used for DDR2,3
	10,         // nWR = 10 (twr_ps/tck_min=15000/1500) //G0102
	0           // RTP = TRTP > (TRTP_TCK*DRAM_FRQ)?round_up(TRTP, DRAM_FRQX2):round_up(TRTP_TCK , DFI_RATIO);  //G0102 - not used for DDR2,3
}; // rxi316_ddr3_timing_1333mhz

struct bus_addr_remap_info ddr2_bus_addr_remap_info = {
	UNREAMP,         // bus_addr[0]
	UNREAMP,         // bus_addr[1]
	UNREAMP,         // bus_addr[2]
	COLU2_REMAP,     // bus_addr[3]
	COLU3_REMAP,     // bus_addr[4]
	COLU4_REMAP,     // bus_addr[5]
	COLU5_REMAP,     // bus_addr[6]
	COLU6_REMAP,     // bus_addr[7]
	COLU7_REMAP,     // bus_addr[8]
	COLU8_REMAP,     // bus_addr[9]
	COLU9_REMAP,     // bus_addr[10]
	BANK0_REMAP,     // bus_addr[11]
	BANK1_REMAP,     // bus_addr[12]
	ROW0_REMAP,      // bus_addr[13]
	ROW1_REMAP,      // bus_addr[14]
	ROW2_REMAP,      // bus_addr[15]
	ROW3_REMAP,      // bus_addr[16]
	ROW4_REMAP,      // bus_addr[17]
	ROW5_REMAP,      // bus_addr[18]
	ROW6_REMAP,      // bus_addr[19]
	ROW7_REMAP,      // bus_addr[20]
	ROW8_REMAP,      // bus_addr[21]
	ROW9_REMAP,      // bus_addr[22]
	ROW10_REMAP,     // bus_addr[23]
	ROW11_REMAP,     // bus_addr[24]
	ROW12_REMAP,     // bus_addr[25]
	UNREAMP,         // bus_addr[26]
	UNREAMP,         // bus_addr[27]
	UNREAMP,         // bus_addr[28]
	UNREAMP,         // bus_addr[29]
	UNREAMP,         // bus_addr[30]
	UNREAMP          // bus_addr[31]
}; //ddr2_dq16_bus_addr_remap_info

struct bus_addr_remap_info ddr3_bus_addr_remap_info = {
	UNREAMP,         // bus_addr[0]
	UNREAMP,         // bus_addr[1]
	UNREAMP,         // bus_addr[2]
	COLU2_REMAP,     // bus_addr[3]
	COLU3_REMAP,     // bus_addr[4]
	COLU4_REMAP,     // bus_addr[5]
	COLU5_REMAP,     // bus_addr[6]
	COLU6_REMAP,     // bus_addr[7]
	COLU7_REMAP,     // bus_addr[8]
	COLU8_REMAP,     // bus_addr[9]
	COLU9_REMAP,     // bus_addr[10]
	BANK0_REMAP,     // bus_addr[11]
	BANK1_REMAP,     // bus_addr[12]
	BANK2_REMAP,     // bus_addr[13]
	ROW0_REMAP,      // bus_addr[14]
	ROW1_REMAP,      // bus_addr[15]
	ROW2_REMAP,      // bus_addr[16]
	ROW3_REMAP,      // bus_addr[17]
	ROW4_REMAP,      // bus_addr[18]
	ROW5_REMAP,      // bus_addr[19]
	ROW6_REMAP,      // bus_addr[20]
	ROW7_REMAP,      // bus_addr[21]
	ROW8_REMAP,      // bus_addr[22]
	ROW9_REMAP,      // bus_addr[23]
	ROW10_REMAP,     // bus_addr[24]
	ROW11_REMAP,     // bus_addr[25]
	ROW12_REMAP,     // bus_addr[26]
	UNREAMP,         // bus_addr[27]
	UNREAMP,         // bus_addr[28]
	UNREAMP,         // bus_addr[29]
	UNREAMP,         // bus_addr[30]
	UNREAMP          // bus_addr[31]
}; //ddr3_dq16_bus_addr_remap_info


struct slot_starve_reg_info slot_starve_info = {
	// cr_slot_park
	0,         // cr_wslot_def  0:read_slot 1:write_slot
	0x10,      // cr_idle_window
	// cr_slot_starve
	0x0,       // cr_lpw_starve
	0x0,       // cr_hpr_starve
	0x5,       // cr_lpr_starve
	0xbf,      // cr_base_starve
	// cr_slot_cntr
	0x08,      // cr_lpw_isu_limit
	0x08,      // cr_hpr_isu_limit
	0x08,      // cr_lpr_isu_limit
	// cr_cbctl0
	8,        //cr_lpr_freeslot_num= ((((`RCMD_BUF_DEPTH)/4)*3) -1)
	0xf,       //cr_lpr_rmw_run_len
	// cr_cbctl1
	1,         //cr_dis_wmg
	1,         //cr_pageopen
	0xf,       //cr_wmg_num_threshold
	0xf,       //cr_lpw_rmw_run_len
	// cr_cbstarve0
	0xFFFFFFFF,     //cr_lpr_max_starve=32'h400
	// cr_cbstarve1
	0xFFFFFFFF,     //cr_hpr_max_starve=32'h400
	// cr_cbstarve2
	0xFFFFFFFF,     //cr_lpw_max_starve=32'h400
	// cr_cbstarve3
	0xFFFFFFFF,     //cr_lpr_rmw_max_starve=32'h400
	// cr_cbstarve4
	0xFFFFFFFF,     //cr_lpw_rmw_max_starve=32'h400
	// cr_bank_sch_ctrl
	0,         //cr_ba_sel_times
	0,         //cr_bg_sel_times
	0          //cr_ra_sel_times
};


