swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/source/ram/hal_dram_init.c
struct rxi316_dram_ctrl_info rxi316_ddr2_dramc_info = {
	0x316,      // idr
	// cr_dcr
	0,          // rank2
	0,          // wr_dbi
	0,          // rd_dbi
	0,          // par
	0,          // gear_down
	0,          // bg2
	0,          // bg_remap
	0,          // zqc
	// cr_iocr
	0,          // odt_2pins;
	0,          // cke_nop;
	0,          // stc_cke;  // default 0: dynamic cke for power saving; 1: for performance profile
	0,          // stc_odt;
	1,          // cmd_2t_en; (dfi_ratio=2,cmd_2t_en=1)
	0,          // rtw_2t_dis;
	0,          // half_csn;
	2,          // rd_pipe;
	0,          // dual_ch_en;
	0,          // addr_share_en;
	0,          // ac_share_en;
	// cr_drr
	1,          // ref_num
	0,          // ref_dis
	0,          // zqcl_inv
	// cr_tpr0
	1,          // tpd_en
	// cr_tpr2
	1,          // zqc_inv or init_ref_num for DDR1/DDR2/LPDDR1
	0,          // lpddr2/lpddr3 init mrr

	// cr_wrap_chop_bd
	CR_CHOP_SIZE_64B, // chop_size

	// cr_addr_remap
	&ddr2_bus_addr_remap_info,
	//&ddr3_dq32_bus_addr_remap_info,

	// cr_performance tuning
	&slot_starve_info
}; // rxi316_ddr3_dramc_info

struct rxi316_dram_ctrl_info rxi316_ddr3_dramc_info = {
	0x316,      // idr
	// cr_dcr
	0,          // rank2
	0,          // wr_dbi
	0,          // rd_dbi
	0,          // par
	0,          // gear_down
	0,          // bg2
	0,          // bg_remap
	0,          // zqc
	// cr_iocr
	0,          // odt_2pins;
	0,          // cke_nop;
	0,          // stc_cke;  // default 0: dynamic cke for power saving; 1: for performance profile
	0,          // stc_odt;
	1,          // cmd_2t_en; (dfi_ratio=2,cmd_2t_en=1)
	0,          // rtw_2t_dis;
	0,          // half_csn;
	2,          // rd_pipe;
	0,          // dual_ch_en;
	0,          // addr_share_en;
	0,          // ac_share_en;
	// cr_drr
	1,          // ref_num
	0,          // ref_dis
	0,          // zqcl_inv
	// cr_tpr0
	1,          // tpd_en
	// cr_tpr2
	1,          // zqc_inv or init_ref_num for DDR1/DDR2/LPDDR1
	0,          // lpddr2/lpddr3 init mrr

	// cr_wrap_chop_bd
	CR_CHOP_SIZE_64B, // chop_size

	// cr_addr_remap
	&ddr3_bus_addr_remap_info,
	//&ddr3_dq32_bus_addr_remap_info,

	// cr_performance tuning
	&slot_starve_info
}; // rxi316_ddr3_dramc_info


struct rxi316_dram_device_info rxi316_ddr2_info_m = {
	//=== DRAM Device ===//
	&rxi316_ddr2_dev,

	//=== DRAM Mode Registers ===//
	&rxi316_ddr2_mode_reg,      // DDR2-1066

	//=== DRAM Timing Parameters ===//
	&rxi316_ddr2_timing,        // DDR2-1066

	//=== DRAMC Info ===//
	//default bus_addr_remap_info is DQ16, changed to DQ32 if needed
	&rxi316_ddr2_dramc_info,

	//=== DRAM Clock Period(ps) ===//
	1000000 / 533,              // DDR-1066: 1876ps

	//DFI_RATIO_1                 //DFI_RATIO_1
	DFI_RATIO_2                 //DFI_RATIO_2
};

struct rxi316_dram_device_info rxi316_ddr3_info_m = {
	//=== DRAM Device ===//
	&rxi316_ddr3_dev,

	//=== DRAM Mode Registers ===//
	&rxi316_ddr3_mode_reg,      // DDR2-1066

	//=== DRAM Timing Parameters ===//
	&rxi316_ddr3_timing,        // DDR2-1066

	//=== DRAMC Info ===//
	//default bus_addr_remap_info is DQ16, changed to DQ32 if needed
	&rxi316_ddr3_dramc_info,

	//=== DRAM Clock Period(ps) ===//
	1000000 / 667,              // DDR-1333: 1500ps

	//DFI_RATIO_1                 //DFI_RATIO_1
	DFI_RATIO_2                 //DFI_RATIO_2
};

void hal_dramc_ftend_init(DRAM_FE_TypeDef *dram_ft_dev)
{
	// port 0 enable
	dram_ft_dev->pn_portctrl_0 = 0;
	// port 1 enable
	dram_ft_dev->pn_portctrl_1 = 0;
	// port 2 enable
	dram_ft_dev->pn_portctrl_2 = 0;
	// port 3 enable
	dram_ft_dev->pn_portctrl_3 = 0;
	// port 4 enable
	dram_ft_dev->pn_portctrl_4 = 0;
	// port 5 enable
	dram_ft_dev->pn_portctrl_5 = 0;

	//Maximum number of free slots reserved for LP read commands in channel 0.
	dram_ft_dev->cm_fe_rrb_0 = 0x8;

	dram_ft_dev->pn_rqos_0 = 0x2100a09;
	dram_ft_dev->pn_wqos_0 = 0x2100a09;
	dram_ft_dev->pn_rqos_1 = 0x2100a09;
	dram_ft_dev->pn_wqos_1 = 0x2100a09;
	dram_ft_dev->pn_rqos_2 = 0x2100a09;
	dram_ft_dev->pn_wqos_2 = 0x2100a09;
	dram_ft_dev->pn_rqos_3 = 0x2100a09;
	dram_ft_dev->pn_wqos_3 = 0x2100a09;
	dram_ft_dev->pn_rqos_4 = 0x2100a09;
	dram_ft_dev->pn_wqos_4 = 0x2100a09;
	dram_ft_dev->pn_rqos_5 = 0x2100a09;
	dram_ft_dev->pn_wqos_5 = 0x2100a09;

	HAL_WRITE32(0x40004000, 0x414, 0xFFF0FF);//RXI3100 Read QoS,
	HAL_WRITE32(0x40004000, 0x418, 0xFFF0FF);//RXI3100 Write QoS,

}

void hal_dramc_perf_tune(DRAMC_TypeDef *dramc_dev, struct rxi316_dram_device_info *rxi316_dram_info)
{
	uint32_t colu_bfo = 2;
	uint32_t bank_bfo = 2;
	uint32_t row_bfo  = 5;
	uint32_t rank_bfo = 2;
	uint32_t bg_bfo   = 2;
	uint32_t ch_bfo   = 2;
	uint32_t dq_bfo;

	uint32_t bus_addr[32];
	int      i;

	int      colu_remap_bits;
	int      bank_remap_bits; // bank+rank+bg
	int      dram_colu_bits;
	int      dram_bank_bits;  // bank+rank+bg

	uint32_t axi_row0_remap, axi_row1_remap, axi_row2_remap, axi_row3_remap, axi_row4_remap, axi_row5_remap, axi_row6_remap, axi_row7_remap;
	uint32_t axi_row8_remap, axi_row9_remap, axi_row10_remap, axi_row11_remap, axi_row12_remap, axi_row13_remap, axi_row14_remap, axi_row15_remap;
	uint32_t axi_row16_remap;
	uint32_t axi_bank0_remap, axi_bank1_remap, axi_bank2_remap;
	uint32_t axi_colu2_remap, axi_colu3_remap, axi_colu4_remap, axi_colu5_remap, axi_colu6_remap, axi_colu7_remap, axi_colu8_remap, axi_colu9_remap;
	uint32_t axi_colu10_remap, axi_colu11_remap;
	uint32_t axi_rank_remap;
	uint32_t axi_ch_remap;
	uint32_t axi_bg0_remap, axi_bg1_remap;

	uint32_t cr_row0_remap, cr_row1_remap, cr_row2_remap, cr_row3_remap, cr_row4_remap, cr_row5_remap, cr_row6_remap, cr_row7_remap;
	uint32_t cr_row8_remap, cr_row9_remap, cr_row10_remap, cr_row11_remap, cr_row12_remap, cr_row13_remap, cr_row14_remap, cr_row15_remap;
	uint32_t cr_row16_remap;
	uint32_t cr_bank0_remap, cr_bank1_remap, cr_bank2_remap;
	uint32_t cr_colu2_remap, cr_colu3_remap, cr_colu4_remap, cr_colu5_remap, cr_colu6_remap, cr_colu7_remap, cr_colu8_remap, cr_colu9_remap;
	uint32_t cr_colu10_remap, cr_colu11_remap;
	uint32_t cr_rank_remap;
	uint32_t cr_ch_remap;
	uint32_t cr_bg0_remap, cr_bg1_remap;

