swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/source/ram/hal_dram_init.c
	if (rxi316_dram_info->dev->dq_width == DQ_32) {
		dq_bfo = 2;
	} else if (rxi316_dram_info->dev->dq_width == DQ_16) {
		dq_bfo = 1;
	} else if (rxi316_dram_info->dev->dq_width == DQ_8) {
		dq_bfo = 0;
	} else { // DQ_48
		dq_bfo = 2;
	}

	bus_addr[0 ]  = rxi316_dram_info->dramc_info->bus_addr_bit->bus_addr_0 ;
	bus_addr[1 ]  = rxi316_dram_info->dramc_info->bus_addr_bit->bus_addr_1 ;
	bus_addr[2 ]  = rxi316_dram_info->dramc_info->bus_addr_bit->bus_addr_2 ;
	bus_addr[3 ]  = rxi316_dram_info->dramc_info->bus_addr_bit->bus_addr_3 ;
	bus_addr[4 ]  = rxi316_dram_info->dramc_info->bus_addr_bit->bus_addr_4 ;
	bus_addr[5 ]  = rxi316_dram_info->dramc_info->bus_addr_bit->bus_addr_5 ;
	bus_addr[6 ]  = rxi316_dram_info->dramc_info->bus_addr_bit->bus_addr_6 ;
	bus_addr[7 ]  = rxi316_dram_info->dramc_info->bus_addr_bit->bus_addr_7 ;
	bus_addr[8 ]  = rxi316_dram_info->dramc_info->bus_addr_bit->bus_addr_8 ;
	bus_addr[9 ]  = rxi316_dram_info->dramc_info->bus_addr_bit->bus_addr_9 ;
	bus_addr[10]  = rxi316_dram_info->dramc_info->bus_addr_bit->bus_addr_10;
	bus_addr[11]  = rxi316_dram_info->dramc_info->bus_addr_bit->bus_addr_11;
	bus_addr[12]  = rxi316_dram_info->dramc_info->bus_addr_bit->bus_addr_12;
	bus_addr[13]  = rxi316_dram_info->dramc_info->bus_addr_bit->bus_addr_13;
	bus_addr[14]  = rxi316_dram_info->dramc_info->bus_addr_bit->bus_addr_14;
	bus_addr[15]  = rxi316_dram_info->dramc_info->bus_addr_bit->bus_addr_15;
	bus_addr[16]  = rxi316_dram_info->dramc_info->bus_addr_bit->bus_addr_16;
	bus_addr[17]  = rxi316_dram_info->dramc_info->bus_addr_bit->bus_addr_17;
	bus_addr[18]  = rxi316_dram_info->dramc_info->bus_addr_bit->bus_addr_18;
	bus_addr[19]  = rxi316_dram_info->dramc_info->bus_addr_bit->bus_addr_19;
	bus_addr[20]  = rxi316_dram_info->dramc_info->bus_addr_bit->bus_addr_20;
	bus_addr[21]  = rxi316_dram_info->dramc_info->bus_addr_bit->bus_addr_21;
	bus_addr[22]  = rxi316_dram_info->dramc_info->bus_addr_bit->bus_addr_22;
	bus_addr[23]  = rxi316_dram_info->dramc_info->bus_addr_bit->bus_addr_23;
	bus_addr[24]  = rxi316_dram_info->dramc_info->bus_addr_bit->bus_addr_24;
	bus_addr[25]  = rxi316_dram_info->dramc_info->bus_addr_bit->bus_addr_25;
	bus_addr[26]  = rxi316_dram_info->dramc_info->bus_addr_bit->bus_addr_26;
	bus_addr[27]  = rxi316_dram_info->dramc_info->bus_addr_bit->bus_addr_27;
	bus_addr[28]  = rxi316_dram_info->dramc_info->bus_addr_bit->bus_addr_28;
	bus_addr[29]  = rxi316_dram_info->dramc_info->bus_addr_bit->bus_addr_29;
	bus_addr[30]  = rxi316_dram_info->dramc_info->bus_addr_bit->bus_addr_30;
	bus_addr[31]  = rxi316_dram_info->dramc_info->bus_addr_bit->bus_addr_31;

	// initial valu 32: unremap to bus_addr[31:0]
	axi_row0_remap   = axi_row1_remap   = axi_row2_remap  = axi_row3_remap  =
			axi_row4_remap   = axi_row5_remap   = axi_row6_remap  = axi_row7_remap  =
								   axi_row8_remap   = axi_row9_remap   = axi_row10_remap = axi_row11_remap =
										   axi_row12_remap  = axi_row13_remap  = axi_row14_remap = axi_row15_remap =
												   axi_row16_remap  = 32;
	axi_bank0_remap  = axi_bank1_remap  = axi_bank2_remap = 32;
	axi_colu2_remap  = axi_colu3_remap  = axi_colu4_remap = axi_colu5_remap =
			axi_colu6_remap  = axi_colu7_remap  = axi_colu8_remap = axi_colu9_remap =
								   axi_colu10_remap = axi_colu11_remap = 32;
	axi_rank_remap   = 32;
	axi_ch_remap     = 32;
	axi_bg0_remap    = 32;
	axi_bg1_remap    = 32;

	colu_remap_bits = 0;
	bank_remap_bits = 0; // bank+rank+bg
	dram_colu_bits  = 0;
	dram_bank_bits  = 0; // bank+rank+bg

	// decode row/bank/colu/rank/bg/ch remap to bus_addr[n]
	for (i = 0; i < 32; i++) {
		if (bus_addr[i] == 0) {
			axi_colu2_remap = i;
			colu_remap_bits = colu_remap_bits + 1;
		} else if (bus_addr[i] == 1) {
			axi_colu3_remap = i;
			colu_remap_bits = colu_remap_bits + 1;
		} else if (bus_addr[i] == 2) {
			axi_colu4_remap = i;
			colu_remap_bits = colu_remap_bits + 1;
		} else if (bus_addr[i] == 3) {
			axi_colu5_remap = i;
			colu_remap_bits = colu_remap_bits + 1;
		} else if (bus_addr[i] == 4) {
			axi_colu6_remap = i;
			colu_remap_bits = colu_remap_bits + 1;
		} else if (bus_addr[i] == 5) {
			axi_colu7_remap = i;
			colu_remap_bits = colu_remap_bits + 1;
		} else if (bus_addr[i] == 6) {
			axi_colu8_remap = i;
			colu_remap_bits = colu_remap_bits + 1;
		} else if (bus_addr[i] == 7) {
			axi_colu9_remap = i;
			colu_remap_bits = colu_remap_bits + 1;
		} else if (bus_addr[i] == 8) {
			axi_colu10_remap = i;
			colu_remap_bits  = colu_remap_bits + 1;
		} else if (bus_addr[i] == 9) {
			axi_colu11_remap = i;
			colu_remap_bits  = colu_remap_bits + 1;
		} else if (bus_addr[i] == 10) {
			axi_bank0_remap = i;
			bank_remap_bits = bank_remap_bits + 1;
		} else if (bus_addr[i] == 11) {
			axi_bank1_remap = i;
			bank_remap_bits = bank_remap_bits + 1;
		} else if (bus_addr[i] == 12) {
			axi_bank2_remap = i;
			bank_remap_bits = bank_remap_bits + 1;
		} else if (bus_addr[i] == 13) {
			axi_bg0_remap = i;
			bank_remap_bits = bank_remap_bits + 1;
		} else if (bus_addr[i] == 14) {
			axi_bg1_remap = i;
			bank_remap_bits = bank_remap_bits + 1;
		} else if (bus_addr[i] == 15) {
			axi_rank_remap = i;
			bank_remap_bits = bank_remap_bits + 1;
		} else if (bus_addr[i] == 16) {
			axi_row0_remap = i;
		} else if (bus_addr[i] == 17) {
			axi_row1_remap = i;
		} else if (bus_addr[i] == 18) {
			axi_row2_remap = i;
		} else if (bus_addr[i] == 19) {
			axi_row3_remap = i;
		} else if (bus_addr[i] == 20) {
			axi_row4_remap = i;
		} else if (bus_addr[i] == 21) {
			axi_row5_remap = i;
		} else if (bus_addr[i] == 22) {
			axi_row6_remap = i;
		} else if (bus_addr[i] == 23) {
			axi_row7_remap = i;
		} else if (bus_addr[i] == 24) {
			axi_row8_remap = i;
		} else if (bus_addr[i] == 25) {
			axi_row9_remap = i;
		} else if (bus_addr[i] == 26) {
			axi_row10_remap = i;
		} else if (bus_addr[i] == 27) {
			axi_row11_remap = i;
		} else if (bus_addr[i] == 28) {
			axi_row12_remap = i;
		} else if (bus_addr[i] == 29) {
			axi_row13_remap = i;
		} else if (bus_addr[i] == 30) {
			axi_row14_remap = i;
		} else if (bus_addr[i] == 31) {
			axi_row15_remap = i;
		}
	}

	dram_colu_bits = rxi316_dram_info->dev->dram_colu_bits;
	if (rxi316_dram_info->dev->bank == BANK_2) {
		dram_bank_bits = 1;
	} else if (rxi316_dram_info->dev->bank == BANK_4) {
		dram_bank_bits = 2;
	} else if (rxi316_dram_info->dev->bank == BANK_8) {
		dram_bank_bits = 3;
	} else if (rxi316_dram_info->dev->bank == BANK_16) {
		dram_bank_bits = 4;
	} else {
		dram_bank_bits = 3;
	}

