swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/source/ram/hal_dram_init.c
	if (colu_remap_bits != (dram_colu_bits - 2)) {
		DBG_DRAM_INFO("> [ADDR REMAP ERROR]: colu_remap_bits != dram_colu_bits!!!\r\n");
	}
	if (bank_remap_bits != dram_bank_bits) {
		DBG_DRAM_INFO("> [ADDR REMAP ERROR]: bank_remap_bits != dram_bank_bits!!!\r\n");
	}

	// decode cr_reg value
	cr_row0_remap   = (axi_row0_remap   != 32) ? (axi_row0_remap   - row_bfo  - dq_bfo - 0) : 15;
	cr_row1_remap   = (axi_row1_remap   != 32) ? (axi_row1_remap   - row_bfo  - dq_bfo - 1) : 15;
	cr_row2_remap   = (axi_row2_remap   != 32) ? (axi_row2_remap   - row_bfo  - dq_bfo - 2) : 15;
	cr_row3_remap   = (axi_row3_remap   != 32) ? (axi_row3_remap   - row_bfo  - dq_bfo - 3) : 15;
	cr_row4_remap   = (axi_row4_remap   != 32) ? (axi_row4_remap   - row_bfo  - dq_bfo - 4) : 15;
	cr_row5_remap   = (axi_row5_remap   != 32) ? (axi_row5_remap   - row_bfo  - dq_bfo - 5) : 15;
	cr_row6_remap   = (axi_row6_remap   != 32) ? (axi_row6_remap   - row_bfo  - dq_bfo - 6) : 15;
	cr_row7_remap   = (axi_row7_remap   != 32) ? (axi_row7_remap   - row_bfo  - dq_bfo - 7) : 15;
	cr_row8_remap   = (axi_row8_remap   != 32) ? (axi_row8_remap   - row_bfo  - dq_bfo - 8) : 15;
	cr_row9_remap   = (axi_row9_remap   != 32) ? (axi_row9_remap   - row_bfo  - dq_bfo - 9) : 15;
	cr_row10_remap  = (axi_row10_remap  != 32) ? (axi_row10_remap  - row_bfo  - dq_bfo - 10) : 15;
	cr_row11_remap  = (axi_row11_remap  != 32) ? (axi_row11_remap  - row_bfo  - dq_bfo - 11) : 15;
	cr_row12_remap  = (axi_row12_remap  != 32) ? (axi_row12_remap  - row_bfo  - dq_bfo - 12) : 15;
	cr_row13_remap  = (axi_row13_remap  != 32) ? (axi_row13_remap  - row_bfo  - dq_bfo - 13) : 15;
	cr_row14_remap  = (axi_row14_remap  != 32) ? (axi_row14_remap  - row_bfo  - dq_bfo - 14) : 15;
	cr_row15_remap  = (axi_row15_remap  != 32) ? (axi_row15_remap  - row_bfo  - dq_bfo - 15) : 15;
	cr_row16_remap  = (axi_row16_remap  != 32) ? (axi_row16_remap  - row_bfo  - dq_bfo - 16) : 15;

	cr_bank0_remap  = (axi_bank0_remap  != 32) ? (axi_bank0_remap  - bank_bfo - dq_bfo) : 31;
	cr_bank1_remap  = (axi_bank1_remap  != 32) ? (axi_bank1_remap  - bank_bfo - dq_bfo) : 31;
	cr_bank2_remap  = (axi_bank2_remap  != 32) ? (axi_bank2_remap  - bank_bfo - dq_bfo) : 31;

	cr_colu2_remap  = (axi_colu2_remap  != 32) ? (axi_colu2_remap  - colu_bfo - dq_bfo - 0) : 15;
	cr_colu3_remap  = (axi_colu3_remap  != 32) ? (axi_colu3_remap  - colu_bfo - dq_bfo - 1) : 15;
	cr_colu4_remap  = (axi_colu4_remap  != 32) ? (axi_colu4_remap  - colu_bfo - dq_bfo - 2) : 15;
	cr_colu5_remap  = (axi_colu5_remap  != 32) ? (axi_colu5_remap  - colu_bfo - dq_bfo - 3) : 15;
	cr_colu6_remap  = (axi_colu6_remap  != 32) ? (axi_colu6_remap  - colu_bfo - dq_bfo - 4) : 15;
	cr_colu7_remap  = (axi_colu7_remap  != 32) ? (axi_colu7_remap  - colu_bfo - dq_bfo - 5) : 15;
	cr_colu8_remap  = (axi_colu8_remap  != 32) ? (axi_colu8_remap  - colu_bfo - dq_bfo - 6) : 15;
	cr_colu9_remap  = (axi_colu9_remap  != 32) ? (axi_colu9_remap  - colu_bfo - dq_bfo - 7) : 15;
	cr_colu10_remap = (axi_colu10_remap != 32) ? (axi_colu10_remap - colu_bfo - dq_bfo - 8) : 15;
	cr_colu11_remap = (axi_colu11_remap != 32) ? (axi_colu11_remap - colu_bfo - dq_bfo - 9) : 15;

	cr_rank_remap   = (axi_rank_remap   != 32) ? (axi_rank_remap   - rank_bfo - dq_bfo) : 31;
	cr_ch_remap     = (axi_ch_remap     != 32) ? (axi_ch_remap     - ch_bfo   - dq_bfo) : 31;
	cr_bg0_remap    = (axi_bg0_remap    != 32) ? (axi_bg0_remap    - bg_bfo   - dq_bfo) : 31;
	cr_bg1_remap    = (axi_bg1_remap    != 32) ? (axi_bg1_remap    - bg_bfo   - dq_bfo) : 31;

	// ---->cr_row_remap0 setting
	dramc_dev->row_remap0 = (
								(cr_row0_remap  << ADDR_ROW0_REMAP_BFO) |
								(cr_row1_remap  << ADDR_ROW1_REMAP_BFO) |
								(cr_row2_remap  << ADDR_ROW2_REMAP_BFO) |
								(cr_row3_remap  << ADDR_ROW3_REMAP_BFO) |
								(cr_row4_remap  << ADDR_ROW4_REMAP_BFO) |
								(cr_row5_remap  << ADDR_ROW5_REMAP_BFO) |
								(cr_row6_remap  << ADDR_ROW6_REMAP_BFO) |
								(cr_row7_remap  << ADDR_ROW7_REMAP_BFO)
							);

	DBG_DRAM_INFO("===========================================\r\n");
	DBG_DRAM_INFO("RXI316_BE_CR_00000400_INIT_VAL = 0x%08x\r\n", dramc_dev->row_remap0);
	DBG_DRAM_INFO("CR_ROW_REMAP0                  = 0x%08x\r\n", dramc_dev->row_remap0);
	DBG_DRAM_INFO("> cr_row0_remap                = 0x%x\r\n",   cr_row0_remap);
	DBG_DRAM_INFO("> cr_row1_remap                = 0x%x\r\n",   cr_row1_remap);
	DBG_DRAM_INFO("> cr_row2_remap                = 0x%x\r\n",   cr_row2_remap);
	DBG_DRAM_INFO("> cr_row3_remap                = 0x%x\r\n",   cr_row3_remap);
	DBG_DRAM_INFO("> cr_row4_remap                = 0x%x\r\n",   cr_row4_remap);
	DBG_DRAM_INFO("> cr_row5_remap                = 0x%x\r\n",   cr_row5_remap);
	DBG_DRAM_INFO("> cr_row6_remap                = 0x%x\r\n",   cr_row6_remap);
	DBG_DRAM_INFO("> cr_row7_remap                = 0x%x\r\n",   cr_row7_remap);

	// ---->cr_row_remap1 setting
	dramc_dev->row_remap1 = (
								(cr_row8_remap  << ADDR_ROW8_REMAP_BFO) |
								(cr_row9_remap  << ADDR_ROW9_REMAP_BFO) |
								(cr_row10_remap << ADDR_ROW10_REMAP_BFO) |
								(cr_row11_remap << ADDR_ROW11_REMAP_BFO) |
								(cr_row12_remap << ADDR_ROW12_REMAP_BFO) |
								(cr_row13_remap << ADDR_ROW13_REMAP_BFO) |
								(cr_row14_remap << ADDR_ROW14_REMAP_BFO) |
								(cr_row15_remap << ADDR_ROW15_REMAP_BFO)
							);

	DBG_DRAM_INFO("===========================================\r\n");
	DBG_DRAM_INFO("RXI316_BE_CR_00000404_INIT_VAL = 0x%08x\r\n", dramc_dev->row_remap1);
	DBG_DRAM_INFO("CR_ROW_REMAP1                  = 0x%08x\r\n", dramc_dev->row_remap1);
	DBG_DRAM_INFO("> cr_row8_remap                = 0x%x\r\n",   cr_row8_remap);
	DBG_DRAM_INFO("> cr_row9_remap                = 0x%x\r\n",   cr_row9_remap);
	DBG_DRAM_INFO("> cr_row10_remap               = 0x%x\r\n",   cr_row10_remap);
	DBG_DRAM_INFO("> cr_row11_remap               = 0x%x\r\n",   cr_row11_remap);
	DBG_DRAM_INFO("> cr_row12_remap               = 0x%x\r\n",   cr_row12_remap);
	DBG_DRAM_INFO("> cr_row13_remap               = 0x%x\r\n",   cr_row13_remap);
	DBG_DRAM_INFO("> cr_row14_remap               = 0x%x\r\n",   cr_row14_remap);
	DBG_DRAM_INFO("> cr_row15_remap               = 0x%x\r\n",   cr_row15_remap);

