swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/source/ram/hal_dram_init.c
	// ---->cr_row_remap2 setting
	dramc_dev->row_remap2 = (cr_row16_remap << ADDR_ROW16_REMAP_BFO);

	DBG_DRAM_INFO("===========================================\r\n");
	DBG_DRAM_INFO("RXI316_BE_CR_00000408_INIT_VAL = 0x%08x\r\n", dramc_dev->row_remap2);
	DBG_DRAM_INFO("CR_ROW_REMAP2                  = 0x%08x\r\n", dramc_dev->row_remap2);
	DBG_DRAM_INFO("> cr_row16_remap               = 0x%x\r\n",   cr_row16_remap);

	// ---->cr_bank_remap0 setting
	dramc_dev->bank_remap0 = (
								 (cr_bank0_remap  << ADDR_BANK0_REMAP_BFO) |
								 (cr_bank1_remap  << ADDR_BANK1_REMAP_BFO) |
								 (cr_bank2_remap  << ADDR_BANK2_REMAP_BFO)
							 );

	DBG_DRAM_INFO("===========================================\r\n");
	DBG_DRAM_INFO("RXI316_BE_CR_0000040C_INIT_VAL = 0x%08x\r\n", dramc_dev->bank_remap0);
	DBG_DRAM_INFO("CR_BANK_REMAP0                 = 0x%08x\r\n", dramc_dev->bank_remap0);
	DBG_DRAM_INFO("> cr_bank0_remap               = 0x%x\r\n",   cr_bank0_remap);
	DBG_DRAM_INFO("> cr_bank1_remap               = 0x%x\r\n",   cr_bank1_remap);
	DBG_DRAM_INFO("> cr_bank2_remap               = 0x%x\r\n",   cr_bank2_remap);

	// ---->cr_colu_remap0 setting
	dramc_dev->colu_remap0 = (
								 (cr_colu2_remap  << ADDR_COLU2_REMAP_BFO) |
								 (cr_colu3_remap  << ADDR_COLU3_REMAP_BFO) |
								 (cr_colu4_remap  << ADDR_COLU4_REMAP_BFO) |
								 (cr_colu5_remap  << ADDR_COLU5_REMAP_BFO) |
								 (cr_colu6_remap  << ADDR_COLU6_REMAP_BFO) |
								 (cr_colu7_remap  << ADDR_COLU7_REMAP_BFO) |
								 (cr_colu8_remap  << ADDR_COLU8_REMAP_BFO) |
								 (cr_colu9_remap  << ADDR_COLU9_REMAP_BFO)
							 );

	DBG_DRAM_INFO("===========================================\r\n");
	DBG_DRAM_INFO("RXI316_BE_CR_00000410_INIT_VAL = 0x%08x\r\n", dramc_dev->colu_remap0);
	DBG_DRAM_INFO("CR_COLU_REMAP0                 = 0x%08x\r\n", dramc_dev->colu_remap0);
	DBG_DRAM_INFO("> cr_colu2_remap               = 0x%x\r\n",   cr_colu2_remap);
	DBG_DRAM_INFO("> cr_colu3_remap               = 0x%x\r\n",   cr_colu3_remap);
	DBG_DRAM_INFO("> cr_colu4_remap               = 0x%x\r\n",   cr_colu4_remap);
	DBG_DRAM_INFO("> cr_colu5_remap               = 0x%x\r\n",   cr_colu5_remap);
	DBG_DRAM_INFO("> cr_colu6_remap               = 0x%x\r\n",   cr_colu6_remap);
	DBG_DRAM_INFO("> cr_colu7_remap               = 0x%x\r\n",   cr_colu7_remap);
	DBG_DRAM_INFO("> cr_colu8_remap               = 0x%x\r\n",   cr_colu8_remap);
	DBG_DRAM_INFO("> cr_colu9_remap               = 0x%x\r\n",   cr_colu9_remap);

	// ---->cr_colu_remap1 setting
	dramc_dev->colu_remap1 = (
								 (cr_colu10_remap  << ADDR_COLU10_REMAP_BFO) |
								 (cr_colu11_remap  << ADDR_COLU11_REMAP_BFO)
							 );

	DBG_DRAM_INFO("===========================================\r\n");
	DBG_DRAM_INFO("RXI316_BE_CR_00000414_INIT_VAL = 0x%08x\r\n", dramc_dev->colu_remap1);
	DBG_DRAM_INFO("CR_COLU_REMAP1                 = 0x%08x\r\n", dramc_dev->colu_remap1);
	DBG_DRAM_INFO("> cr_colu10_remap              = 0x%x\r\n",   cr_colu10_remap);
	DBG_DRAM_INFO("> cr_colu11_remap              = 0x%x\r\n",   cr_colu11_remap);

	// ---->cr_rank_remap0 setting
	dramc_dev->rank_remap0 = (cr_rank_remap  << ADDR_RANK_REMAP_BFO);

	DBG_DRAM_INFO("===========================================\r\n");
	DBG_DRAM_INFO("RXI316_BE_CR_00000418_INIT_VAL = 0x%08x\r\n", dramc_dev->rank_remap0);
	DBG_DRAM_INFO("CR_RANK_REMAP0                 = 0x%08x\r\n", dramc_dev->rank_remap0);
	DBG_DRAM_INFO("> cr_rank_remap                = 0x%x\r\n",   cr_rank_remap);

	// ---->cr_ch_remap0 setting
	dramc_dev->ch_remap0   = (cr_ch_remap  << ADDR_CH_REMAP_BFO);

	DBG_DRAM_INFO("===========================================\r\n");
	DBG_DRAM_INFO("RXI316_BE_CR_0000041C_INIT_VAL = 0x%08x\r\n", dramc_dev->ch_remap0);
	DBG_DRAM_INFO("CR_CH_REMAP0                   = 0x%08x\r\n", dramc_dev->ch_remap0);
	DBG_DRAM_INFO("> cr_ch_remap                  = 0x%x\r\n",   cr_ch_remap);

	// ---->cr_bg_remap0 setting
	dramc_dev->bg_remap0 = (
							   (cr_bg0_remap  << ADDR_BG0_REMAP_BFO) |
							   (cr_bg1_remap  << ADDR_BG1_REMAP_BFO)
						   );

	DBG_DRAM_INFO("===========================================\r\n");
	DBG_DRAM_INFO("RXI316_BE_CR_00000420_INIT_VAL = 0x%08x\r\n", dramc_dev->bg_remap0);
	DBG_DRAM_INFO("CR_BG_REMAP0                   = 0x%08x\r\n", dramc_dev->bg_remap0);
	DBG_DRAM_INFO("> cr_bg0_remap                 = 0x%x\r\n",   cr_bg0_remap);
	DBG_DRAM_INFO("> cr_bg1_remap                 = 0x%x\r\n",   cr_bg1_remap);

	// ---->cr_slot_park setting
	dramc_dev->slot_park = (
							   (rxi316_dram_info->dramc_info->slot_starve_reg->cr_wslot_def   << SLOT_PERF_PARK_BFO) |
							   (rxi316_dram_info->dramc_info->slot_starve_reg->cr_idle_window << SLOT_IDLE_WINDOW_BFO)
						   );

	DBG_DRAM_INFO("===========================================\r\n");
	DBG_DRAM_INFO("RXI316_BE_CR_00000460_INIT_VAL = 0x%08x\r\n", dramc_dev->slot_park);
	DBG_DRAM_INFO("CR_SLOT_PARK                   = 0x%08x\r\n", dramc_dev->slot_park);
	DBG_DRAM_INFO("> WSLOT_DEF                    = 0x%x\r\n",   rxi316_dram_info->dramc_info->slot_starve_reg->cr_wslot_def);
	DBG_DRAM_INFO("> IDLE_WINDOW                  = 0x%x\r\n",   rxi316_dram_info->dramc_info->slot_starve_reg->cr_idle_window);

	// ---->cr_slot_starve setting
	dramc_dev->slot_starve = (
								 (rxi316_dram_info->dramc_info->slot_starve_reg->cr_lpw_starve  << SLOT_LPW_STARVE_CYC_BFO) |
								 (rxi316_dram_info->dramc_info->slot_starve_reg->cr_hpr_starve  << SLOT_HPR_STARVE_CYC_BFO) |
								 (rxi316_dram_info->dramc_info->slot_starve_reg->cr_lpr_starve  << SLOT_LPR_STARVE_CYC_BFO) |
								 (rxi316_dram_info->dramc_info->slot_starve_reg->cr_base_starve << SLOT_BASE_STARVE_CYC_BFO)
							 );

	DBG_DRAM_INFO("===========================================\r\n");
	DBG_DRAM_INFO("RXI316_BE_CR_00000464_INIT_VAL = 0x%08x\r\n", dramc_dev->slot_starve);
	DBG_DRAM_INFO("CR_SLOT_STARVE                 = 0x%08x\r\n", dramc_dev->slot_starve);
	DBG_DRAM_INFO("> LPW_STARVE                   = 0x%x\r\n",   rxi316_dram_info->dramc_info->slot_starve_reg->cr_lpw_starve);
	DBG_DRAM_INFO("> HPR_STARVE                   = 0x%x\r\n",   rxi316_dram_info->dramc_info->slot_starve_reg->cr_hpr_starve);
	DBG_DRAM_INFO("> LPR_STARVE                   = 0x%x\r\n",   rxi316_dram_info->dramc_info->slot_starve_reg->cr_lpr_starve);
	DBG_DRAM_INFO("> BASE_STARVE                  = 0x%x\r\n",   rxi316_dram_info->dramc_info->slot_starve_reg->cr_base_starve);

	// ---->cr_slot_cntr setting
	dramc_dev->slot_cntr = (
							   (rxi316_dram_info->dramc_info->slot_starve_reg->cr_lpw_isu_limit << SLOT_LPW_IUS_LMT_BFO) |
							   (rxi316_dram_info->dramc_info->slot_starve_reg->cr_hpr_isu_limit << SLOT_HPR_IUS_LMT_BFO) |
							   (rxi316_dram_info->dramc_info->slot_starve_reg->cr_lpr_isu_limit << SLOT_LPR_IUS_LMT_BFO)
						   );

	DBG_DRAM_INFO("===========================================\r\n");
	DBG_DRAM_INFO("RXI316_BE_CR_00000468_INIT_VAL = 0x%08x\r\n", dramc_dev->slot_cntr);
	DBG_DRAM_INFO("CR_SLOT_CNTR                   = 0x%08x\r\n", dramc_dev->slot_cntr);
	DBG_DRAM_INFO("> LPW_ISU_LMT                  = 0x%x\r\n",   rxi316_dram_info->dramc_info->slot_starve_reg->cr_lpw_isu_limit);
	DBG_DRAM_INFO("> HPR_ISU_LMT                  = 0x%x\r\n",   rxi316_dram_info->dramc_info->slot_starve_reg->cr_hpr_isu_limit);
	DBG_DRAM_INFO("> LPR_ISU_LMT                  = 0x%x\r\n",   rxi316_dram_info->dramc_info->slot_starve_reg->cr_lpr_isu_limit);

	// ---->cr_cbctl0 setting
	dramc_dev->cbctl0 = (
							(rxi316_dram_info->dramc_info->slot_starve_reg->cr_lpr_freeslot_num << CBCTL0_LPR_FREESLOT_NUM_BFO) |
							(rxi316_dram_info->dramc_info->slot_starve_reg->cr_lpr_rmw_run_len  << CBCTL0_LPR_RMW_RUN_LEN_BFO)
						);

	DBG_DRAM_INFO("===========================================\r\n");
	DBG_DRAM_INFO("RXI316_BE_CR_00000480_INIT_VAL = 0x%08x\r\n", dramc_dev->cbctl0);
	DBG_DRAM_INFO("CR_CBCTL0                      = 0x%08x\r\n", dramc_dev->cbctl0);
	DBG_DRAM_INFO("> LPR_FREESLOT_NUM             = 0x%x\r\n",   rxi316_dram_info->dramc_info->slot_starve_reg->cr_lpr_freeslot_num);
	DBG_DRAM_INFO("> LPR_RMW_RUN_LEN              = 0x%x\r\n",   rxi316_dram_info->dramc_info->slot_starve_reg->cr_lpr_rmw_run_len);

	// ---->cr_cbctl1 setting
	dramc_dev->cbctl1 = (
							(rxi316_dram_info->dramc_info->slot_starve_reg->cr_dis_wmg           << CBCTL1_DIS_WMG_BFO)           |
							(rxi316_dram_info->dramc_info->slot_starve_reg->cr_pageopen          << CBCTL1_PAGEOPEN_BFO)          |
							(rxi316_dram_info->dramc_info->slot_starve_reg->cr_wmg_num_threshold << CBCTL1_WMG_NUM_THRESHOLD_BFO) |
							(rxi316_dram_info->dramc_info->slot_starve_reg->cr_lpw_rmw_run_len   << CBCTL1_LPW_RMW_RUN_LEN_BFO)
						);

	DBG_DRAM_INFO("===========================================\r\n");
	DBG_DRAM_INFO("RXI316_BE_CR_00000484_INIT_VAL = 0x%08x\r\n", dramc_dev->cbctl1);
	DBG_DRAM_INFO("CR_CBCTL1                      = 0x%08x\r\n", dramc_dev->cbctl1);
	DBG_DRAM_INFO("> DIS_WMG                      = 0x%x\r\n",   rxi316_dram_info->dramc_info->slot_starve_reg->cr_dis_wmg);
	DBG_DRAM_INFO("> PAGEOPEN                     = 0x%x\r\n",   rxi316_dram_info->dramc_info->slot_starve_reg->cr_pageopen);
	DBG_DRAM_INFO("> WMG_NUM_THRESHOLD            = 0x%x\r\n",   rxi316_dram_info->dramc_info->slot_starve_reg->cr_wmg_num_threshold);
	DBG_DRAM_INFO("> LPW_RMW_RUN_LEN              = 0x%x\r\n",   rxi316_dram_info->dramc_info->slot_starve_reg->cr_lpw_rmw_run_len);

	// ---->cr_cbstarve0 setting
	dramc_dev->cbstarve0 = (rxi316_dram_info->dramc_info->slot_starve_reg->cr_lpr_max_starve);

	DBG_DRAM_INFO("===========================================\r\n");
	DBG_DRAM_INFO("RXI316_BE_CR_00000488_INIT_VAL = 0x%08x\r\n", dramc_dev->cbstarve0);
	DBG_DRAM_INFO("CR_CBSTARVE0                   = 0x%08x\r\n", dramc_dev->cbstarve0);
	DBG_DRAM_INFO("> LPR_MAX_STARVE               = 0x%x\r\n",   rxi316_dram_info->dramc_info->slot_starve_reg->cr_lpr_max_starve);

	// ---->cr_cbstarve1 setting
	dramc_dev->cbstarve1 = (rxi316_dram_info->dramc_info->slot_starve_reg->cr_hpr_max_starve);

	DBG_DRAM_INFO("===========================================\r\n");
	DBG_DRAM_INFO("RXI316_BE_CR_0000048C_INIT_VAL = 0x%08x\r\n", dramc_dev->cbstarve1);
	DBG_DRAM_INFO("CR_CBSTARVE1                   = 0x%08x\r\n", dramc_dev->cbstarve1);
	DBG_DRAM_INFO("> HPR_MAX_STARVE               = 0x%x\r\n",   rxi316_dram_info->dramc_info->slot_starve_reg->cr_hpr_max_starve);

