swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/source/ram/hal_dram_init.c
	// ---->cr_cbstarve2 setting
	dramc_dev->cbstarve2 = (rxi316_dram_info->dramc_info->slot_starve_reg->cr_lpw_max_starve);

	DBG_DRAM_INFO("===========================================\r\n");
	DBG_DRAM_INFO("RXI316_BE_CR_00000490_INIT_VAL = 0x%08x\r\n", dramc_dev->cbstarve2);
	DBG_DRAM_INFO("CR_CBSTARVE2                   = 0x%08x\r\n", dramc_dev->cbstarve2);
	DBG_DRAM_INFO("> LPW_MAX_STARVE               = 0x%x\r\n",   rxi316_dram_info->dramc_info->slot_starve_reg->cr_lpw_max_starve);

	// ---->cr_cbstarve3 setting
	dramc_dev->cbstarve3 = (rxi316_dram_info->dramc_info->slot_starve_reg->cr_lpr_rmw_max_starve);

	DBG_DRAM_INFO("===========================================\r\n");
	DBG_DRAM_INFO("RXI316_BE_CR_00000494_INIT_VAL = 0x%08x\r\n", dramc_dev->cbstarve3);
	DBG_DRAM_INFO("CR_CBSTARVE3                   = 0x%08x\r\n", dramc_dev->cbstarve3);
	DBG_DRAM_INFO("> LPR_RMW_MAX_STARVE           = 0x%x\r\n",   rxi316_dram_info->dramc_info->slot_starve_reg->cr_lpr_rmw_max_starve);

	// ---->cr_cbstarve4 setting
	dramc_dev->cbstarve4 = (rxi316_dram_info->dramc_info->slot_starve_reg->cr_lpw_rmw_max_starve);

	DBG_DRAM_INFO("===========================================\r\n");
	DBG_DRAM_INFO("RXI316_BE_CR_00000498_INIT_VAL = 0x%08x\r\n", dramc_dev->cbstarve4);
	DBG_DRAM_INFO("CR_CBSTARVE4                   = 0x%08x\r\n", dramc_dev->cbstarve4);
	DBG_DRAM_INFO("> LPW_RMW_MAX_STARVE           = 0x%x\r\n",   rxi316_dram_info->dramc_info->slot_starve_reg->cr_lpw_rmw_max_starve);

	// ---->cr_bank_sch_ctrl setting
	dramc_dev->bank_sch_ctrl = (
								   (rxi316_dram_info->dramc_info->slot_starve_reg->cr_ba_sel_times  << BANK_SCH_BA_SEL_LMT_BFO) |
								   (rxi316_dram_info->dramc_info->slot_starve_reg->cr_bg_sel_times  << BANK_SCH_BG_SEL_LMT_BFO) |
								   (rxi316_dram_info->dramc_info->slot_starve_reg->cr_ra_sel_times  << BANK_SCH_RA_SEL_LMT_BFO)
							   );

	DBG_DRAM_INFO("===========================================\r\n");
	DBG_DRAM_INFO("RXI316_BE_CR_000004A0_INIT_VAL = 0x%08x\r\n", dramc_dev->bank_sch_ctrl);
	DBG_DRAM_INFO("CR_BANK_SCH_CTRL               = 0x%08x\r\n", dramc_dev->bank_sch_ctrl);
	DBG_DRAM_INFO("> BA_SEL_LMT                   = 0x%x\r\n",   rxi316_dram_info->dramc_info->slot_starve_reg->cr_ba_sel_times);
	DBG_DRAM_INFO("> BG_SEL_LMT                   = 0x%x\r\n",   rxi316_dram_info->dramc_info->slot_starve_reg->cr_bg_sel_times);
	DBG_DRAM_INFO("> RA_SEL_LMT                   = 0x%x\r\n",   rxi316_dram_info->dramc_info->slot_starve_reg->cr_ra_sel_times);

} // rxi316_perf_tune


void hal_dramc_init(DRAMC_TypeDef *dramc_dev, struct rxi316_dram_device_info *rxi316_dram_info)
{
	// DRAM info
	uint32_t     pctl_period, dfi_rate;//adj_pctl_period;
	// CR_DRAM_SIZE
	uint32_t     dram_size;
	// CR_MISC
	uint32_t     page_size;
	enum         rxi316_dram_bank_size    bank_size;
	enum         rxi316_dram_bst_len      bst_size;
	enum         rxi316_hybr_dq_size      hybr_size;
	// CR_WRAP_CHOP_BD
	enum         cr_chop_size      chop_size;
	// CR_DCR
	uint32_t     cr_rank2, cr_wr_dbi, cr_rd_dbi, cr_par, cr_gear_down, cr_bg2, cr_bg_remap, cr_zqc;
	uint32_t     dq_width;
	// CR_MRx
	uint32_t     dram_bstlen, dram_rl, dram_wl, dram_type;
	// CR_MRINFO
	uint32_t     cas_wr, cas_rd;
	uint32_t     cas_add, mrinfo_add_lat;
	uint32_t     mrinfo_dqsck_max, mrinfo_wr_lat, mrinfo_rd_lat;
	uint32_t     sdram_wr, mrinfo_nwr, mrinfo_rtp;
	// CR_IOCR
	uint32_t     tphy_rd, tphy_wd, tphy_wl, dual_ch_en, addr_share_en, ac_share_en;
	uint32_t     odt_2pins, cke_nop, stc_cke, stc_odt, cmd_2t_en, rtw_2t_dis, half_csn, rd_pipe;
	// CR_DRR
	uint32_t     trfc_tck, trefi_tck, ref_num, ref_dis, zqcl_inv;
	// CR_TPR0~CR_TPR2
	uint32_t     trp_tck, trp_tck_tmp, tras_tck, tras_tck_tmp, twr_tck, trtp_tck, tcke_tck, tpd_en, tzqcs_tck;
	uint32_t     trrd_tck, trc_tck, trcd_tck, tccd_tck, tccd_l_tck, twtr_tck, trtw_tck, tfaw_tck;
	uint32_t     tmrd_tck, zqc_inv, rst_tus_tck, tus_tck, tns_tck;
	// CR_TPR3
	uint32_t     trpab_pb_ps, trpab_pb_tck, tras_msb, tfaw_msb;
	uint32_t     dpin_cmd_lat, trcd_msb, twtr_msb, trtw_msb, trfc_msb, twr_msb, tppd_tck;
	uint32_t     tccd_s_tck, twtr_s_tck, trrd_s_tck, tccd_kw_tck, tccd_r_tck;
	// CR_TPR4~CR_TPR5
	uint32_t     trp_msb;
	uint32_t     odt_hold_default, odt_hold, odt_dly;
	// CR_MR0
	uint32_t     mr0_bl;
	enum         rxi316_dram_bst_type     bst_type;
	uint32_t     mr0_cas, mr0_wr, mr0_bit2, mr0_bit12, mr0_bit13;
	// CR_MR1
	uint32_t     dll_en, mr1_bit2, mr1_bl, dram_al, mr1_wr_lpddr23, mr1_wr_lpddr4, rtt_norm;
	// CR_MR2
	uint32_t     mr2_cas, mr2_cwl, mr2_bit4, dyc_odt_en ;
	// CR_MR0~CR_MR 22
	uint32_t     mr0_or_val, mr1_or_val, mr2_or_val;


	DBG_DRAM_INFO("===========================================\r\n");
	DBG_DRAM_INFO("************  DRAM Information  ***********\r\n");

	dfi_rate = 1 << (uint32_t)(rxi316_dram_info->dfi_rate);
	pctl_period = (rxi316_dram_info->ddr_period_ps) * (dfi_rate); // according DFI_RATE to setting
	//adj_pctl_period = (1000000 / 533) * (dfi_rate); // according DFI_RATE to setting
	dram_type = rxi316_dram_info->dev->device_type;

	if (rxi316_dram_info->dev ->bst_len == BST_LEN_4) {
		dram_bstlen = 4;
	} else if (rxi316_dram_info->dev ->bst_len == BST_LEN_8) {
		dram_bstlen = 8;
	} else { // BST_16
		dram_bstlen = 16;
	}

	dram_wl = rxi316_dram_info->mode_reg->dram_wr_lat;
	dram_rl = rxi316_dram_info->mode_reg->dram_rd_lat;
	dram_al = rxi316_dram_info->mode_reg->dram_add_lat;


	DBG_DRAM_INFO("===========================================\r\n");
	DBG_DRAM_INFO("> DRAM_PERIOD   = %d ps\r\n", rxi316_dram_info->ddr_period_ps);
	DBG_DRAM_INFO("> PCTL_PERIOD   = %d ps\r\n", pctl_period);
	DBG_DRAM_INFO("> DRAM_TYPE     = %d\r\n", dram_type);
	DBG_DRAM_INFO("> DRAM_BSTLEN   = %d\r\n", dram_bstlen);
	DBG_DRAM_INFO("> DRAM WL       = %d\r\n", dram_wl);
	DBG_DRAM_INFO("> DRAM RL       = %d\r\n", dram_rl);
	DBG_DRAM_INFO("> DRAM AL       = %d\r\n", dram_al);



	DBG_DRAM_INFO("===========================================\r\n");
	DBG_DRAM_INFO("************  CR Information  ************\r\n");
	DBG_DRAM_INFO("base address = %x\r\n", &(dramc_dev->dram_size));

	// ----> cr_dram_size setting
	dram_size = 0x3ffffff;
	dramc_dev->dram_size = dram_size;


	DBG_DRAM_INFO("===========================================\r\n");
	DBG_DRAM_INFO("RXI316_BE_CR_00000230_INIT_VAL = 0x%08x\r\n", dramc_dev->dram_size);
	DBG_DRAM_INFO("CR_MISC                        = 0x%08x\r\n", dramc_dev->dram_size);
	DBG_DRAM_INFO("> DRAM_SIZE                    = 0x%x\r\n",   dram_size);

	// ----> cr_misc setting
	if (rxi316_dram_info->dev->dq_width == DQ_32) {
		page_size = (rxi316_dram_info->dev->dram_colu_bits) + 2 - 8;
	} else if (rxi316_dram_info->dev->dq_width == DQ_16) {
		page_size = (rxi316_dram_info->dev->dram_colu_bits) + 1 - 8;
	} else if (rxi316_dram_info-> dev-> dq_width == DQ_8) {
		page_size = (rxi316_dram_info->dev->dram_colu_bits) + 0 - 8;
	} else {
		page_size = (rxi316_dram_info->dev->dram_colu_bits) + 2 - 8;
	}

	bank_size = (rxi316_dram_info->dev->bank);
	bst_size  = (rxi316_dram_info->dev->bst_len);
	hybr_size = (rxi316_dram_info->dev->hybr_size);

	dramc_dev->misc = (
						  (page_size   << WRAP_MISC_PAGE_SIZE_BFO) |
						  (bank_size   << WRAP_MISC_BANK_SIZE_BFO) |
						  (bst_size    << WRAP_MISC_BST_SIZE_BFO) |
						  (hybr_size   << WRAP_MISC_HYBR_SIZE_BFO)
					  );

	DBG_DRAM_INFO("===========================================\r\n");
	DBG_DRAM_INFO("RXI316_BE_CR_00000224_INIT_VAL = 0x%08x\r\n", dramc_dev->misc);
	DBG_DRAM_INFO("CR_MISC                        = 0x%08x\r\n", dramc_dev->misc);
	DBG_DRAM_INFO("> PAGE_SIZE                    = 0x%x\r\n",   page_size);
	DBG_DRAM_INFO("> BANK_SIZE                    = 0x%x\r\n",   bank_size);
	DBG_DRAM_INFO("> BST_SIZE                     = 0x%x\r\n",   bst_size);
	DBG_DRAM_INFO("> HYBR_SIZE                    = 0x%x\r\n",   hybr_size);

	// ----> cr_wrap_chop_bd setting
	chop_size = rxi316_dram_info->dramc_info->chop_size;
	dramc_dev->wrap_chop_bd = (
								  (chop_size   << WRAP_CHOP_SIZE_BFO)
							  );

	DBG_DRAM_INFO("===========================================\r\n");
	DBG_DRAM_INFO("RXI316_BE_CR_00000228_INIT_VAL = 0x%08x\r\n", dramc_dev->wrap_chop_bd);
	DBG_DRAM_INFO("CR_WRAP_CHOP_BD                = 0x%08x\r\n", dramc_dev->wrap_chop_bd);
	DBG_DRAM_INFO("> CR_CHOP_SIZE                 = 0x%x\r\n",   chop_size);

	// ----> cr_dcr setting
	dram_type    = (rxi316_dram_info->dev->device_type);
	dq_width     = 1 << (uint32_t)(rxi316_dram_info->dev->dq_width);
	cr_rank2     = rxi316_dram_info->dramc_info->rank2;
	cr_wr_dbi    = rxi316_dram_info->dramc_info->wr_dbi;
	cr_rd_dbi    = rxi316_dram_info->dramc_info->rd_dbi;
	cr_par       = rxi316_dram_info->dramc_info->par;
	cr_gear_down = rxi316_dram_info->dramc_info->gear_down;
	cr_bg2       = rxi316_dram_info->dramc_info->bg2;
	cr_bg_remap  = rxi316_dram_info->dramc_info->bg_remap;
	cr_zqc       = rxi316_dram_info->dramc_info->zqc;
	dramc_dev->dcr = (
						 (dram_type   << PCTL_DCR_DDR_BFO) |
						 (dq_width    << PCTL_DCR_DQ_WID_BFO) |
						 (dfi_rate    << PCTL_DCR_DFI_RATE_BFO) |
						 (cr_rank2    << PCTL_DCR_RANK2_BFO) |
						 (cr_wr_dbi   << PCTL_DCR_WR_DBI_BFO) |
						 (cr_rd_dbi   << PCTL_DCR_RD_DBI_BFO) |
						 (cr_par      << PCTL_DCR_PAR_BFO) |
						 (cr_gear_down << PCTL_DCR_GEAR_DOWN_BFO) |
						 (cr_bg2      << PCTL_DCR_BG2_BFO) |
						 (cr_bg_remap << PCTL_DCR_BG_REMAP_BFO) |
						 (cr_zqc      << PCTL_DCR_ZQC_BFO)
					 );

	DBG_DRAM_INFO("===========================================\r\n");
	DBG_DRAM_INFO("RXI316_BE_CR_00000004_INIT_VAL = 0x%08x\r\n", dramc_dev->dcr);
	DBG_DRAM_INFO("CR_DCR                         = 0x%08x\r\n", dramc_dev->dcr);
	DBG_DRAM_INFO("> DDR TYPE                     = 0x%x\r\n",   dram_type);
	DBG_DRAM_INFO("> DQ WIDTH                     = 0x%x\r\n",   dq_width);
	DBG_DRAM_INFO("> DFI RATE                     = 0x%x\r\n",   dfi_rate);
	DBG_DRAM_INFO("> RANK2                        = 0x%x\r\n",   cr_rank2);
	DBG_DRAM_INFO("> WR_DBI                       = 0x%x\r\n",   cr_wr_dbi);
	DBG_DRAM_INFO("> RD_DBI                       = 0x%x\r\n",   cr_rd_dbi);
	DBG_DRAM_INFO("> PAR                          = 0x%x\r\n",   cr_par);
	DBG_DRAM_INFO("> GEAR_DOWN                    = 0x%x\r\n",   cr_gear_down);
	DBG_DRAM_INFO("> BG2                          = 0x%x\r\n",   cr_bg2);
	DBG_DRAM_INFO("> BG_REMAP                     = 0x%x\r\n",   cr_bg_remap);
	DBG_DRAM_INFO("> ZQC                          = 0x%x\r\n",   cr_zqc);

