swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/source/ram/hal_dram_init.c
	// ----> cr_iocr setting
	odt_2pins     = rxi316_dram_info->dramc_info->odt_2pins;
	cke_nop       = rxi316_dram_info->dramc_info->cke_nop;
	stc_cke       = rxi316_dram_info->dramc_info->stc_cke;
	stc_odt       = rxi316_dram_info->dramc_info->stc_odt;
	cmd_2t_en     = rxi316_dram_info->dramc_info->cmd_2t_en;
	rtw_2t_dis    = rxi316_dram_info->dramc_info->rtw_2t_dis;
	half_csn      = rxi316_dram_info->dramc_info->half_csn;
	rd_pipe       = rxi316_dram_info->dramc_info->rd_pipe;
	tphy_wl       = 0; // not support in rtk_phy
	tphy_wd       = ROUND_UP(rxi316_dram_info->mode_reg->tphy_wd, dfi_rate);
	tphy_rd       = ROUND_UP(rxi316_dram_info->mode_reg->tphy_rd, dfi_rate);
	dual_ch_en    = rxi316_dram_info->dramc_info->dual_ch_en;
	addr_share_en = rxi316_dram_info->dramc_info->addr_share_en;
	ac_share_en   = rxi316_dram_info->dramc_info->ac_share_en;

	dramc_dev->iocr = (
						  (odt_2pins     << PCTL_IOCR_ODT_2PINS_BFO) |
						  (cke_nop       << PCTL_IOCR_CKE_NOP_BFO) |
						  (stc_cke       << PCTL_IOCR_STC_CKE_BFO) |
						  (stc_odt       << PCTL_IOCR_STC_ODT_BFO) |
						  (cmd_2t_en     << PCTL_IOCR_CMD_2T_EN_BFO) |
						  (rtw_2t_dis    << PCTL_IOCR_RTW_2T_DIS_BFO) |
						  (half_csn      << PCTL_IOCR_HALF_CSN_BFO) |
						  (rd_pipe       << PCTL_IOCR_RD_PIPE_BFO) |
						  (tphy_wd       << PCTL_IOCR_TPHY_WD_BFO) |
						  (tphy_wl       << PCTL_IOCR_TPHY_WL_BFO) |
						  (tphy_rd       << PCTL_IOCR_TPHY_RD_EN_BFO) |
						  (dual_ch_en    << PCTL_IOCR_DC_CH1_BFO) |
						  (addr_share_en << PCTL_IOCR_ADDR_SHARE_BFO) |
						  (ac_share_en   << PCTL_IOCR_AC_SHARE_BFO)
					  );

	DBG_DRAM_INFO("===========================================\r\n");
	DBG_DRAM_INFO("RXI316_BE_CR_00000008_INIT_VAL = 0x%08x\r\n", dramc_dev->iocr);
	DBG_DRAM_INFO("CR_IOCR                        = 0x%08x\r\n", dramc_dev->iocr);
	DBG_DRAM_INFO("> ODT_2PINS                    = 0x%x\r\n",   odt_2pins);
	DBG_DRAM_INFO("> CKE_NOP                      = 0x%x\r\n",   cke_nop);
	DBG_DRAM_INFO("> STC_CKE                      = 0x%x\r\n",   stc_odt);
	DBG_DRAM_INFO("> STC_ODT                      = 0x%x\r\n",   stc_cke);
	DBG_DRAM_INFO("> CMD_2T_EN                    = 0x%x\r\n",   cmd_2t_en);
	DBG_DRAM_INFO("> RTW_2T_DIS                   = 0x%x\r\n",   rtw_2t_dis);
	DBG_DRAM_INFO("> HALF_CSN                     = 0x%x\r\n",   half_csn);
	DBG_DRAM_INFO("> RD_PIPE                      = 0x%x\r\n",   rd_pipe);
	DBG_DRAM_INFO("> TPHY_WD                      = 0x%x\r\n",   tphy_wd);
	DBG_DRAM_INFO("> TPHY_WL                      = 0x%x\r\n",   tphy_wl);
	DBG_DRAM_INFO("> TPHY_RD                      = 0x%x\r\n",   tphy_rd);
	DBG_DRAM_INFO("> DC_CH1                       = 0x%x\r\n",   dual_ch_en);
	DBG_DRAM_INFO("> ADDR_SHARE                   = 0x%x\r\n",   addr_share_en);
	DBG_DRAM_INFO("> AC_SHARE                     = 0x%x\r\n",   ac_share_en);

	// ----> cr_mr0 setting
	mr0_bl       = 0;
	mr0_bit2     = 0;
	mr0_bit12    = 0;
	mr0_bit13    = 0;
	mr0_cas      = 0;
	mr0_wr       = 0;
	mr0_or_val   = rxi316_dram_info->mode_reg-> mr0_or_val;
	if (dram_bstlen == 8) {
		if ((rxi316_dram_info->dev->device_type) == DDR_2) {
			mr0_bl  = 3;
		} else {
			mr0_bl  = 0;
		}
	} else if (dram_bstlen == 4) {
		if ((rxi316_dram_info->dev->device_type) == DDR_3 ||
			(rxi316_dram_info->dev->device_type) == DDR_2) {
			mr0_bl  = 2;
		}
	}

	bst_type = (rxi316_dram_info->dev->bst_type);

	if ((rxi316_dram_info->dev->device_type) == DDR_2) {
		mr0_cas  = dram_rl;
	} else if ((rxi316_dram_info->dev->device_type) == DDR_3) {
		if (dram_rl < 5) {
			mr0_bit2 = 0;
			mr0_cas  = 1;
		} else {
			if (dram_rl < 12) {
				mr0_bit2 = 0;
				mr0_cas = dram_rl - 4;
			} else {
				mr0_bit2 = 1;
				mr0_cas = dram_rl - 12;
			}
		}
	}

	sdram_wr = rxi316_dram_info->timing->nWR;
	if ((rxi316_dram_info->dev->device_type) == DDR_2) { // nWR setting
		if ((sdram_wr  >= 2) && (sdram_wr  <= 8)) { // 2~8
			mr0_wr = sdram_wr - 1 ;
		}
	} else if ((rxi316_dram_info->dev->device_type) == DDR_3) {
		if (sdram_wr  < 5) {  // 5
			mr0_wr = 1;
		} else if ((sdram_wr  >= 5) && (sdram_wr  <= 8)) { // 5~8
			mr0_wr = sdram_wr  - 4;
		} else if ((sdram_wr  >= 9) && (sdram_wr <= 14)) { // 9~14
			mr0_wr = sdram_wr / 2 ;
		} else { // 15, 16
			mr0_wr = 0;
		}
	}
	// DDR1, LPDDR1 without nWR

	if ((rxi316_dram_info->dev->device_type) != DDR_2) {
		mr0_bit12 = 1;
	}

	dramc_dev->mr0 = (
						 (mr0_bl      << PCTL_MR0_BL_BFO)        |
						 (mr0_bit2    << 2)                      |
						 (bst_type    << PCTL_MR0_BST_TYPE_BFO)  |
						 (mr0_cas     << PCTL_MR0_CAS_BFO)       |
						 (mr0_wr      << PCTL_MR0_WR_BFO)        |
						 (mr0_bit12   << 12)                     |
						 (mr0_bit13   << 13)                     |
						 (mr0_or_val)
					 );

	DBG_DRAM_INFO("===========================================\r\n");
	DBG_DRAM_INFO("RXI316_BE_CR_00000034_INIT_VAL = 0x%08x\r\n", dramc_dev->mr0);
	DBG_DRAM_INFO("CR_MR0                         = 0x%08x\r\n", dramc_dev->mr0);
	DBG_DRAM_INFO("> MR0_BL                       = 0x%x\r\n",   mr0_bl);
	DBG_DRAM_INFO("> BST_TYPE                     = 0x%x\r\n",   bst_type);
	DBG_DRAM_INFO("> MR0_CAS                      = 0x%x\r\n",   mr0_cas);
	DBG_DRAM_INFO("> MR0_WR                       = 0x%x\r\n",   mr0_wr);

	// ----> cr_mr1 setting

	dll_en   = 0; // 1:enable DLL, 0:disable
	mr1_bit2 = 0;
	mr1_bl   = 0;
	mr1_wr_lpddr23 = 0;
	mr1_wr_lpddr4  = 0;
	rtt_norm   = 0; // Enable DDR4 RTT_NORM for RZQ/4
	mr1_or_val = rxi316_dram_info->mode_reg->mr1_or_val;

	// nWR setting
	sdram_wr = rxi316_dram_info->timing->nWR;

	dramc_dev->mr1 = (
						 (dll_en          << PCTL_MR1_DLL_EN_BFO)   |    // mr1[0]
						 (mr1_bit2        << 2)   |                      // mr1[2]
						 (mr1_bl          << PCTL_MR1_BL_BFO)   |        // mr1[2:0]
						 (dram_al         << PCTL_MR1_ADD_LAT_BFO)   |   // mr1[4:3]
						 (mr1_wr_lpddr23  << PCTL_MR1_WR_LP23_BFO)   |   // mr1[7:5]
						 (mr1_wr_lpddr4   << PCTL_MR1_WR_LP4_BFO)   |    // mr1[6:4]
						 (rtt_norm        << PCTL_MR1_RTT_NORM_EN_BFO) | // mr1[10:8]
						 (mr1_or_val)
					 );

	DBG_DRAM_INFO("===========================================\r\n");
	DBG_DRAM_INFO("RXI316_BE_CR_00000038_INIT_VAL = 0x%08x\r\n", dramc_dev->mr1);
	DBG_DRAM_INFO("CR_MR1                         = 0x%08x\r\n", dramc_dev->mr1);
	DBG_DRAM_INFO("> DLL_EN                       = 0x%x\r\n",   dll_en);
	DBG_DRAM_INFO("> ADD_LAT                      = 0x%x\r\n",   dram_al);
	DBG_DRAM_INFO("> MR1_WR_LPDDR23               = 0x%x\r\n",   mr1_wr_lpddr23);
	DBG_DRAM_INFO("> MR1_WR_LPDDR4                = 0x%x\r\n",   mr1_wr_lpddr4);
	DBG_DRAM_INFO("> RTT_NORM                     = 0x%x\r\n",   rtt_norm);

	// ----> cr_mr2 setting
	mr2_cas    = 0;
	mr2_cwl    = 0;
	mr2_bit4   = 0;
	mr2_or_val = rxi316_dram_info->mode_reg-> mr2_or_val;
	if ((rxi316_dram_info->dev->device_type) == DDR_3) {
		mr2_cwl = dram_wl - 5;
	}

	if ((rxi316_dram_info->dev->device_type) == DDR_2) {
		dyc_odt_en = 0; // Disable dynamic odt
	} else {
		if (rxi316_dram_info->dramc_info->stc_odt) {
			dyc_odt_en = 0; // Disable dynamic odt
		} else {
			dyc_odt_en = 1; // Enable dynamic odt
		}
	}

	dramc_dev->mr2 = (
						 (mr2_cas         << PCTL_MR2_CAS_BFO) |          // mr2[3:0]
						 (mr2_cwl         << PCTL_MR2_CWL_BFO) |          // mr2[5:3]
						 (mr2_bit4        << 4) |                         // mr2[4]
						 (dyc_odt_en      << PCTL_MR2_DYC_ODT_EN_BFO) |   // mr2[10:9]
						 (mr2_or_val)
					 );

	DBG_DRAM_INFO("===========================================\r\n");
	DBG_DRAM_INFO("RXI316_BE_CR_0000003C_INIT_VAL = 0x%08x\r\n", dramc_dev->mr2);
	DBG_DRAM_INFO("CR_MR2                         = 0x%08x\r\n", dramc_dev->mr2);
	DBG_DRAM_INFO("> MR2_CAS                      = 0x%x\r\n",   mr2_cas);
	DBG_DRAM_INFO("> MR2_CWL                      = 0x%x\r\n",   mr2_cwl);
	DBG_DRAM_INFO("> DYC_ODT_EN                   = 0x%x\r\n",   dyc_odt_en);

