swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/source/ram/hal_dram_init.c
	// ----> cr_mrinfo setting
	mrinfo_dqsck_max = 0;

	cas_wr = (rxi316_dram_info->mode_reg->dram_wr_lat) +
			 (rxi316_dram_info->mode_reg->dram_par_lat);

	cas_rd = (rxi316_dram_info->mode_reg->dram_rd_lat) +
			 (rxi316_dram_info->mode_reg->dram_par_lat);

	cas_add = (rxi316_dram_info->mode_reg->dram_add_lat);

	mrinfo_wr_lat  = ROUND_UP(cas_wr, dfi_rate);
	mrinfo_rd_lat  = ROUND_UP(cas_rd, dfi_rate);
	mrinfo_add_lat = ROUND_UP(cas_add, dfi_rate);

	// nWR setting
	sdram_wr = rxi316_dram_info->timing->nWR; // 8
	mrinfo_nwr = 0;
	if ((rxi316_dram_info->dev->device_type) == DDR_2 || // sdram_wr= 2 ~ 8
		(rxi316_dram_info->dev->device_type) == DDR_3) { // sdram_wr= 3~8
		// nWR setting
		mrinfo_nwr = ROUND_UP(sdram_wr, dfi_rate); // 4
	}

	// tRTP setting
	trtp_tck = ROUND_UP(rxi316_dram_info->timing->trtp_ps, pctl_period);

	if (dram_type == DDR_2) {
		trtp_tck = dram_al + (((dram_bstlen / 2) - 2) / dfi_rate) + trtp_tck;
	} else {
		trtp_tck = dram_al + trtp_tck;
	}

	// nRTP setting
	mrinfo_rtp = trtp_tck;

	dramc_dev->mrinfo = (
							(mrinfo_wr_lat    << PCTL_MRINFO_WR_LAT_BFO) |
							(mrinfo_rd_lat    << PCTL_MRINFO_RD_LAT_BFO) |
							(mrinfo_add_lat   << PCTL_MRINFO_ADD_LAT_BFO) |
							(mrinfo_dqsck_max << PCTL_MRINFO_TDQSCK_MAX_BFO) |
							(mrinfo_nwr       << PCTL_MRINFO_NWR_BFO)        |
							(mrinfo_rtp       << PCTL_MRINFO_RTP_BFO)
						);

	DBG_DRAM_INFO("===========================================\r\n");
	DBG_DRAM_INFO("RXI316_BE_CR_00000030_INIT_VAL = 0x%08x\r\n", dramc_dev->mrinfo);
	DBG_DRAM_INFO("CR_MRINFO                      = 0x%08x\r\n", dramc_dev->mrinfo);
	DBG_DRAM_INFO("> WR_LAT                       = 0x%x\r\n",   mrinfo_wr_lat);
	DBG_DRAM_INFO("> RD_LAT                       = 0x%x\r\n",   mrinfo_rd_lat);
	DBG_DRAM_INFO("> ADD_LAT                      = 0x%x\r\n",   mrinfo_add_lat);
	DBG_DRAM_INFO("> tDQSCK_MAX                   = 0x%x\r\n",   mrinfo_dqsck_max);
	DBG_DRAM_INFO("> nWR                          = 0x%x\r\n",   mrinfo_nwr);
	DBG_DRAM_INFO("> RTP                          = 0x%x\r\n",   mrinfo_rtp);

	// ----> cr_drr setting
	trfc_tck = ROUND_UP(rxi316_dram_info->timing->trfc_ps, pctl_period);

	/*DDR2 & DDR3 should use 533 MHz to calculate trefi, if use lower speed, this value should be modified*/
	trefi_tck = ROUND_UP(rxi316_dram_info->timing->trefi_ps, pctl_period) - 200;
	/*For 400MHz / 480MHz setting*/
	//trefi_tck = 0x550;

	ref_num = 1;
	ref_dis  = rxi316_dram_info->dramc_info->ref_dis;
	zqcl_inv = rxi316_dram_info->dramc_info->zqcl_inv;

	dramc_dev->drr = (
						 ((trfc_tck & 0xff)  << PCTL_DRR_TRFC_BFO) |
						 (trefi_tck          << PCTL_DRR_TREF_BFO) |
						 (ref_num            << PCTL_DRR_REF_NUM_BFO) |
						 (ref_dis            << PCTL_DRR_REF_DIS_BFO) |
						 (zqcl_inv           << PCTL_DRR_ZQCL_INV_BFO)
					 );

	DBG_DRAM_INFO("===========================================\r\n");
	DBG_DRAM_INFO("RXI316_BE_CR_00000010_INIT_VAL = 0x%08x\r\n", dramc_dev->drr);
	DBG_DRAM_INFO("CR_DRR                         = 0x%08x\r\n", dramc_dev->drr);
	DBG_DRAM_INFO("> tRFC                         = 0x%x\r\n",   trfc_tck);
	DBG_DRAM_INFO("> tRFE                         = 0x%x\r\n",   trefi_tck);
	DBG_DRAM_INFO("> REF_NUM                      = 0x%x\r\n",   ref_num);
	DBG_DRAM_INFO("> REF_DIS                      = 0x%x\r\n",   ref_dis);
	DBG_DRAM_INFO("> ZQCL_INV                     = 0x%x\r\n",   zqcl_inv);

	// ----> cr_tpr0 setting
	tras_tck = ROUND_UP(rxi316_dram_info->timing->tras_ps, pctl_period);
	twr_tck  = ROUND_UP(rxi316_dram_info->timing->twr_ps, pctl_period);
	trp_tck  = ROUND_UP(rxi316_dram_info->timing->trp_ps, pctl_period);

	if (rxi316_dram_info->timing->tcke_ps > rxi316_dram_info->timing->txp_ps) {
		tcke_tck = ROUND_UP(rxi316_dram_info->timing->tcke_ps, pctl_period);
	} else {
		tcke_tck = ROUND_UP(rxi316_dram_info->timing->txp_ps, pctl_period);
	}

	tpd_en    = rxi316_dram_info->dramc_info->tpd_en;
	tzqcs_tck = ROUND_UP(rxi316_dram_info->timing->tzqcs_tck, dfi_rate);

	dramc_dev->tpr0 = (
						  (trp_tck   & 0xf   << PCTL_TPR0_TRP_BFO) |
						  ((tras_tck & 0x1f) << PCTL_TPR0_TRAS_BFO) |
						  ((twr_tck  & 0xf)  << PCTL_TPR0_TWR_BFO) |
						  (trtp_tck          << PCTL_TPR0_TRTP_BFO) |
						  (tcke_tck          << PCTL_TPR0_TCKE_BFO) |
						  (tpd_en            << PCTL_TPR0_TPD_EN_BFO) |
						  (tzqcs_tck         << PCTL_TPR0_TZQCS_BFO)
					  );

	DBG_DRAM_INFO("===========================================\r\n");
	DBG_DRAM_INFO("RXI316_BE_CR_00000014_INIT_VAL = 0x%08x\r\n", dramc_dev->tpr0);
	DBG_DRAM_INFO("CR_TPR0                        = 0x%08x\r\n", dramc_dev->tpr0);
	DBG_DRAM_INFO("> tRP                          = 0x%x\r\n",   trp_tck);
	DBG_DRAM_INFO("> tRAS                         = 0x%x\r\n",   tras_tck);
	DBG_DRAM_INFO("> tWR                          = 0x%x\r\n",   twr_tck);
	DBG_DRAM_INFO("> tRTP                         = 0x%x\r\n",   trtp_tck);
	DBG_DRAM_INFO("> tCKE                         = 0x%x\r\n",   tcke_tck);
	DBG_DRAM_INFO("> tPD_EN                       = 0x%x\r\n",   tpd_en);
	DBG_DRAM_INFO("> tZQCS                        = 0x%x\r\n",   tzqcs_tck);

	// ----> cr_tpr1 setting
	// trrd,trc,trcd,tccd,twtr,trtw,tfaw_lsb
	trrd_tck     = ROUND_UP(rxi316_dram_info->timing->trrd_ps, pctl_period);
	tras_tck_tmp = ROUND_UP(rxi316_dram_info->timing->tras_ps, pctl_period);
	trp_tck_tmp  = ROUND_UP(rxi316_dram_info->timing->trp_ps, pctl_period);
	trc_tck      = ROUND_UP(rxi316_dram_info->timing->trc_ps, pctl_period);

	if ((tras_tck_tmp + trp_tck_tmp) > trc_tck) {
		trc_tck = tras_tck_tmp + trp_tck_tmp;
	}

	trcd_tck = (ROUND_UP(rxi316_dram_info->timing->trcd_ps, pctl_period)) - 1; // cmd_sch: bank_sch more 1t
	tccd_tck = ROUND_UP(rxi316_dram_info->timing->tccd_tck, dfi_rate);
	twtr_tck = ROUND_UP(rxi316_dram_info->timing->twtr_tck, dfi_rate);

	// trtw expression
	// ==== trtw clock cycles in dram domain
	trtw_tck = 0;
	if (dram_type == DDR_2) {
		trtw_tck = dram_bstlen / 2 + 2;
		trtw_tck = ROUND_UP(trtw_tck, dfi_rate);
	} else if (dram_type == DDR_3) {
		trtw_tck = dram_rl + dram_bstlen / 2 + 2 - dram_wl;
		trtw_tck = ROUND_UP(trtw_tck, dfi_rate) + 1;
	}

	tfaw_tck = ROUND_UP(rxi316_dram_info->timing->tfaw_ps, pctl_period);

	tccd_l_tck = 0;

