swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/source/ram/hal_dram_init.c
	dramc_dev->tpr1 = (
						  (trrd_tck           << PCTL_TPR1_TRRD_BFO) |
						  (trc_tck            << PCTL_TPR1_TRC_BFO) |
						  ((trcd_tck & 0xf)   << PCTL_TPR1_TRCD_BFO) |
						  (tccd_tck           << PCTL_TPR1_TCCD_BFO) |
						  ((twtr_tck & 0x7)   << PCTL_TPR1_TWTR_BFO) |
						  ((trtw_tck & 0xf)   << PCTL_TPR1_TRTW_BFO) |
						  ((tfaw_tck & 0x1f)  << PCTL_TPR1_TFAW_BFO) |
						  (tccd_l_tck         << 29)
					  );

	DBG_DRAM_INFO("===========================================\r\n");
	DBG_DRAM_INFO("RXI316_BE_CR_00000018_INIT_VAL = 0x%08x\r\n", dramc_dev->tpr1);
	DBG_DRAM_INFO("CR_TPR1                        = 0x%08x\r\n", dramc_dev->tpr1);
	DBG_DRAM_INFO("> tRRD                         = 0x%x\r\n",   trrd_tck);
	DBG_DRAM_INFO("> tRC                          = 0x%x\r\n",   trc_tck);
	DBG_DRAM_INFO("> tRCD                         = 0x%x\r\n",   trcd_tck);
	DBG_DRAM_INFO("> tCCD                         = 0x%x\r\n",   tccd_tck);
	DBG_DRAM_INFO("> tWTR                         = 0x%x\r\n",   twtr_tck);
	DBG_DRAM_INFO("> tRTW                         = 0x%x\r\n",   trtw_tck);
	DBG_DRAM_INFO("> tFAW                         = 0x%x\r\n",   tfaw_tck);

	// ----> cr_tpr2 setting
	// trrd,trc,trcd,tccd,twtr,trtw,tfaw_lsb

	if ((rxi316_dram_info->dev->device_type) == DDR_2) {
		zqc_inv = 2; // init refresh num or zq short cmd interval times(by enable zqc:dcr[30])
	} else {
		zqc_inv = rxi316_dram_info->dramc_info->zqc_inv; // init refresh num or zq short cmd interval times(by enable zqc:dcr[30])
	}

	tmrd_tck = 0;
	if ((rxi316_dram_info->dev->device_type) == DDR_3) {
		tmrd_tck = rxi316_dram_info->timing->tmrd_tck;
	} else if ((rxi316_dram_info->dev->device_type) == DDR_2) {
		tmrd_tck = ROUND_UP(rxi316_dram_info->timing->tmrd_tck, pctl_period);
	}

	// rst_tus, tus, tns
	rst_tus_tck = 0;
	tus_tck = 0;
	tns_tck = 0;
	if (dram_type == DDR_2) { // DDR2
		rst_tus_tck = 0;
		tus_tck     = ((200000000 / pctl_period) >> 10) + 1;      // 200us
		tns_tck     = ((400000   / pctl_period) >> 7) + 1;        // 400ns
	} else if (dram_type == DDR_3) {
		rst_tus_tck = ((200000000 / pctl_period) >> 10) + 1;      // 200us
		tus_tck     = ((500000000 / pctl_period) >> 10) + 1;      // 500us
		tns_tck     = ((trfc_tck + (10000 / pctl_period)) >> 7) + 1; // max (5tck, tRFC+10ns)
	}

	dramc_dev->tpr2 = (
						  (zqc_inv      << PCTL_TPR2_INIT_REF_NUM_BFO) |
						  (tmrd_tck     << PCTL_TPR2_TMRD_BFO) |
						  (tns_tck      << PCTL_TPR2_INIT_NS_BFO) |
						  (tus_tck      << PCTL_TPR2_INIT_US_BFO) |
						  (rst_tus_tck  << PCTL_TPR2_INIT_RST_US_BFO)
					  );

	DBG_DRAM_INFO("===========================================\r\n");
	DBG_DRAM_INFO("RXI316_BE_CR_0000001C_INIT_VAL = 0x%08x\r\n", dramc_dev->tpr2);
	DBG_DRAM_INFO("CR_TPR2                        = 0x%08x\r\n", dramc_dev->tpr2);
	DBG_DRAM_INFO("> ZQC_INV(INT_REF_NUM)         = 0x%x\r\n",   zqc_inv);
	DBG_DRAM_INFO("> tMRD                         = 0x%x\r\n",   tmrd_tck);
	DBG_DRAM_INFO("> tNS                          = 0x%x\r\n",   tns_tck);
	DBG_DRAM_INFO("> tUS                          = 0x%x\r\n",   tus_tck);
	DBG_DRAM_INFO("> RST_tUS                      = 0x%x\r\n",   rst_tus_tck);

	// ----> cr_tpr3 setting
	trpab_pb_ps = 0;
	trpab_pb_tck = ROUND_UP(trpab_pb_ps, pctl_period);

	tras_msb = (tras_tck & 0x20) >> 5; // tras_msb, mask tras lsb[4:0]

	tfaw_tck = ROUND_UP(rxi316_dram_info->timing->tfaw_ps, pctl_period);
	tfaw_msb = (tfaw_tck & 0x20) >> 5; // tfaw_msb, mask tfaw_lsb[4:0]

	dpin_cmd_lat = 0;

	trcd_msb = (trcd_tck & 0x10)  >> 4; // trcd_msb, mask trcd_lsb[3:0]
	twtr_msb = (twtr_tck & 0x8)   >> 3; // twtr_msb, mask twtr_lsb[2:0]
	trtw_msb = (trtw_tck & 0x10)  >> 4; // trtw_msb, mask trtw_lsb[3:0]
	trfc_msb = (trfc_tck & 0x100) >> 8; // trfc_msb, mask trfc_lsb[7:0]
	twr_msb  = (twr_tck  & 0x10)  >> 4; // twr msb

	tppd_tck = 0;

	tccd_s_tck = ROUND_UP(rxi316_dram_info->timing->tccd_s_tck, dfi_rate);
	twtr_s_tck = ROUND_UP(rxi316_dram_info->timing->twtr_s_tck, dfi_rate);
	trrd_s_tck = ROUND_UP(rxi316_dram_info->timing->trrd_s_tck, dfi_rate);

	// tccd_r: control rank tccd timing(for dqs preamable confict), using tccd_tck + 1
	if ((dram_bstlen / dfi_rate) > rxi316_dram_info->timing->tccd_tck) {
		trrd_s_tck = ROUND_UP(((dram_bstlen / dfi_rate) - rxi316_dram_info->timing->tccd_tck),  dfi_rate);
	}

	tccd_r_tck = 0;
	tccd_kw_tck = 0;

	dramc_dev->tpr3 = (
						  (trpab_pb_tck  << PCTL_TPR3_TRPAB_PB_BFO) |
						  (tras_msb      << PCTL_TPR3_TRAS_MSB_BFO) |
						  (tfaw_msb      << PCTL_TPR3_TFAW_MSB_BFO) |
						  (dpin_cmd_lat  << PCTL_TPR3_DPIN_LAT_BFO) |
						  (trcd_msb      << PCTL_TPR3_TRCD_MSB_BFO) |
						  (twtr_msb      << PCTL_TPR3_TWTR_MSB_BFO) |
						  (trtw_msb      << PCTL_TPR3_TRTW_MSB_BFO) |
						  (trfc_msb      << PCTL_TPR3_TRFC_MSB_BFO) |
						  (twr_msb       << PCTL_TPR3_TWR_MSB_BFO) |
						  (tppd_tck      << PCTL_TPR3_TPPD_BFO) |
						  (tccd_s_tck    << PCTL_TPR3_TCCD_S_BFO) |
						  (twtr_s_tck    << PCTL_TPR3_TWTR_S_BFO) |
						  (trrd_s_tck    << PCTL_TPR3_TRRD_S_BFO) |
						  (tccd_kw_tck   << PCTL_TPR3_TCCD_KW_BFO) |
						  (tccd_r_tck    << PCTL_TPR3_TCCD_R_BFO)
					  );

	DBG_DRAM_INFO("===========================================\r\n");
	DBG_DRAM_INFO("RXI316_BE_CR_00000020_INIT_VAL = 0x%08x\r\n", dramc_dev->tpr3);
	DBG_DRAM_INFO("CR_TPR3                        = 0x%08x\r\n", dramc_dev->tpr3);
	DBG_DRAM_INFO("> tRPAB_PB                     = 0x%x\r\n",   trpab_pb_tck);
	DBG_DRAM_INFO("> tRAS_MSB                     = 0x%x\r\n",   tras_msb);
	DBG_DRAM_INFO("> tFAW_MSB                     = 0x%x\r\n",   tfaw_msb);
	DBG_DRAM_INFO("> DPIN_CMD_LAT                 = 0x%x\r\n",   dpin_cmd_lat);
	DBG_DRAM_INFO("> tRCD_MSB                     = 0x%x\r\n",   trcd_msb);
	DBG_DRAM_INFO("> tWTR_MSB                     = 0x%x\r\n",   twtr_msb);
	DBG_DRAM_INFO("> tRTW_MSB                     = 0x%x\r\n",   trtw_msb);
	DBG_DRAM_INFO("> tRFC_MSB                     = 0x%x\r\n",   trfc_msb);
	DBG_DRAM_INFO("> tWR_MSB                      = 0x%x\r\n",   twr_msb);
	DBG_DRAM_INFO("> tPPD                         = 0x%x\r\n",   tppd_tck);
	DBG_DRAM_INFO("> tCCD_S                       = 0x%x\r\n",   tccd_s_tck);
	DBG_DRAM_INFO("> tWTR_S                       = 0x%x\r\n",   twtr_s_tck);
	DBG_DRAM_INFO("> tRRD_S                       = 0x%x\r\n",   trrd_s_tck);
	DBG_DRAM_INFO("> tCCD_KW                      = 0x%x\r\n",   tccd_kw_tck);
	DBG_DRAM_INFO("> tCCD_R                       = 0x%x\r\n",   tccd_r_tck);

