swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/source/ram/hal_dram_init.c
	// ----> cr_tpr4 setting
	trp_msb = (trp_tck & 0x10)  >> 4; // trp_msb, mask trp_lsb[3:0]
	dramc_dev->tpr4 = (
						  (trp_msb  << PCTL_TPR4_TRP_MSB_BFO)
					  );

	DBG_DRAM_INFO("===========================================\r\n");
	DBG_DRAM_INFO("RXI316_BE_CR_00000090_INIT_VAL = 0x%08x\r\n", dramc_dev->tpr4);
	DBG_DRAM_INFO("CR_TPR4                        = 0x%08x\r\n", dramc_dev->tpr4);
	DBG_DRAM_INFO("> tRP_MSB                      = 0x%x\r\n",   trp_msb);

	// ----> cr_tpr5 setting
	odt_hold_default  = dram_bstlen / 2 + 2;
	odt_dly           = 0;

	if (dfi_rate == 1) {
		odt_hold = odt_hold_default;
	} else { // dfi2 use 2tpreabmle
		odt_hold = odt_hold_default + 1;
	}

	dramc_dev->tpr5 = (
						  (odt_hold  << PCTL_TPR5_ODT_HOLD_BFO) |
						  (odt_dly   << PCTL_TPR5_ODT_DLY_BFO)
					  );

	DBG_DRAM_INFO("===========================================\r\n");
	DBG_DRAM_INFO("RXI316_BE_CR_00000094_INIT_VAL = 0x%08x\r\n", dramc_dev->tpr5);
	DBG_DRAM_INFO("CR_TPR5                        = 0x%08x\r\n", dramc_dev->tpr5);
	DBG_DRAM_INFO("> ODT_HOLD                     = 0x%x\r\n",   odt_hold);
	DBG_DRAM_INFO("> ODT_DLY                      = 0x%x\r\n",   odt_dly);

	// ----> cr_imr setting
	dramc_dev->imr = 0xffff;

	DBG_DRAM_INFO("===========================================\r\n");
	DBG_DRAM_INFO("RXI316_BE_CR_000000CC_INIT_VAL = 0x%08x\r\n", dramc_dev->imr);
	DBG_DRAM_INFO("CR_IMR                         = 0x%08x\r\n", dramc_dev->imr);

	// set all_mode idle
	dramc_dev->csr = 0x700;

	// start to init
	dramc_dev->ccr = 0x1;
	// wait init_done: read cr_ccr[0] == 1
	while (((dramc_dev->ccr) & 0x1) != 0x1);

	DBG_DRAM_INFO("===========================================\r\n");
	DBG_DRAM_INFO("RXI316_BE_CR_00000000_INIT_VAL = 0x%08x\r\n", dramc_dev->ccr);
	DBG_DRAM_INFO("CR_CCR                         = 0x%08x\r\n", dramc_dev->ccr);

	// enter mem_mode
	dramc_dev->csr = 0x600;
	// check mode state
	while (((dramc_dev->csr) & 0x7ff) != 0x600);

	DBG_DRAM_INFO("===========================================\r\n");
	DBG_DRAM_INFO("RXI316_BE_CR_0000000C_INIT_VAL = 0x%08x\r\n", dramc_dev->csr);
	DBG_DRAM_INFO("CR_CSR                         = 0x%08x\r\n", dramc_dev->csr);
} // rxi316_dram_init

void cpu_read_modify_write(volatile uint32_t *addr, u32 data, u32 data_mask)
{
	u32 rmw_data = HAL_READ32(addr, 0x0);

	rmw_data = (rmw_data & (~data_mask)) | (data & data_mask);
	HAL_WRITE32(addr, 0x0, rmw_data);
}

#if CONFIG_PXP || SIMU_DDR_PXP_INIT_FLOW_EN // PXP , asic simu run flow
void hal_ddr2_phy_init(uint32_t dram_period_ps)
{
	DPI_TypeDef *dpi_dev_map = (DPI_TypeDef *) DPI_REG_BASE_ADDR;
	u32 rmw_data;

	hal_delay_us(1);
	cpu_read_modify_write(&dpi_dev_map->DPI_CRT_RST_CTL, 0x100, 0x100);

	hal_delay_us(1);
	cpu_read_modify_write(&dpi_dev_map->DPI_CRT_RST_CTL, 0x30, 0x30);

	cpu_read_modify_write(&dpi_dev_map->DPI_AFIFO_STR_1, 0x300000, 0x300000);

	cpu_read_modify_write(&dpi_dev_map->DPI_CRT_RST_CTL, 0x1, 0x1);

	rmw_data = dpi_dev_map->DPI_SSC1;
	rmw_data &= ~(DPI_MASK_GRAN_SET | DPI_MASK_DOT_GRAN);
	rmw_data |= (0x1CC | (0x4 << DPI_SHIFT_DOT_GRAN));
	dpi_dev_map->DPI_SSC1 = rmw_data;

	rmw_data = dpi_dev_map->DPI_SSC2;
	rmw_data &= ~(DPI_MASK_F_CODE | DPI_MASK_F_CODE_T);
	rmw_data |= (0x222 | (0x2AA << DPI_SHIFT_F_CODE_T));
	dpi_dev_map->DPI_SSC2 = rmw_data;

	rmw_data = dpi_dev_map->DPI_SSC3;
	rmw_data &= ~(DPI_MASK_N_CODE | DPI_MASK_N_CODE_T);
	rmw_data |= (0xA | (0xA << DPI_SHIFT_N_CODE_T));
	dpi_dev_map->DPI_SSC3 = rmw_data;

	//Set DCC/DLL
	cpu_read_modify_write(&dpi_dev_map->DPI_DCC_CMD, 0x3, 0x20000007);
	cpu_read_modify_write(&dpi_dev_map->DPI_DCC_CS, 0x3, 0x20000007);
	cpu_read_modify_write(&dpi_dev_map->DPI_DCC_CS1, 0x3, 0x20000007);
	cpu_read_modify_write(&dpi_dev_map->DPI_DCC_DQS_0, 0x3, 0x20000007);
	cpu_read_modify_write(&dpi_dev_map->DPI_DCC_DQS_1, 0x3, 0x20000007);
	cpu_read_modify_write(&dpi_dev_map->DPI_DCC_DQS_2, 0x3, 0x20000007);
	cpu_read_modify_write(&dpi_dev_map->DPI_DCC_DQS_3, 0x3, 0x20000007);
	cpu_read_modify_write(&dpi_dev_map->DPI_DCC_DQ_0, 0x3, 0x20000007);
	cpu_read_modify_write(&dpi_dev_map->DPI_DCC_DQ_1, 0x3, 0x20000007);
	cpu_read_modify_write(&dpi_dev_map->DPI_DCC_DQ_2, 0x3, 0x20000007);
	cpu_read_modify_write(&dpi_dev_map->DPI_DCC_DQ_3, 0x3, 0x20000007);
	cpu_read_modify_write(&dpi_dev_map->DPI_DCC_CK_0, 0x3, 0x20000007);
	cpu_read_modify_write(&dpi_dev_map->DPI_DCC_CK_1, 0x3, 0x20000007);

	cpu_read_modify_write(&dpi_dev_map->DPI_PLL_PI1, 0x80000, 0x1F0000);
	cpu_read_modify_write(&dpi_dev_map->DPI_PLL_PI2, 0x80808, 0x1F1F1F);
	hal_delay_us(10);

	cpu_read_modify_write(&dpi_dev_map->DPI_CRT_CTL, 0x102, 0x08080132);
	cpu_read_modify_write(&dpi_dev_map->DPI_CRT_CTL, 0x40000000, 0x40000000);
	hal_delay_us(1);
	cpu_read_modify_write(&dpi_dev_map->DPI_CRT_RST_CTL, 0x2, 0x2);

	hal_delay_us(100);

	cpu_read_modify_write(&dpi_dev_map->DPI_CRT_RST_CTL, 0x0, 0x8);
	cpu_read_modify_write(&dpi_dev_map->DPI_CRT_RST_CTL, 0xC, 0xC);
	hal_delay_us(1);

	cpu_read_modify_write(&dpi_dev_map->DPI_SSC3, 0x4000000, 0x4000000);
	cpu_read_modify_write(&dpi_dev_map->DPI_SSC3, 0x0, 0x4000000);
	cpu_read_modify_write(&dpi_dev_map->DPI_SSC0, 0xA, 0xA);

	cpu_read_modify_write(&dpi_dev_map->DPI_PLL_CTL1, 0x80000000, 0x80000000);
	hal_delay_us(1);

	rmw_data = dpi_dev_map->DPI_PLL_CTL3;
	rmw_data &= ~(DPI_MASK_ICP | DPI_MASK_LOOP_PI_ISEL | DPI_MASK_POST_PI_BIAS | DPI_MASK_POST_PI_RL);
	rmw_data |= (0x3 << DPI_SHIFT_ICP) | (0x3 << DPI_SHIFT_LOOP_PI_ISEL) | (0x1 << DPI_SHIFT_POST_PI_BIAS) | (0x1 << DPI_SHIFT_POST_PI_RL);
	dpi_dev_map->DPI_PLL_CTL3 = rmw_data;

	hal_delay_us(50);

	/*dfi_mck_slice_all*/
	cpu_read_modify_write(&dpi_dev_map->DPI_PLL_CTL0, 0x0, 0xFFE);
	hal_delay_us(1);
	cpu_read_modify_write(&dpi_dev_map->DPI_PLL_CTL1, 0x0, 0x20000);
	hal_delay_us(1);
	cpu_read_modify_write(&dpi_dev_map->DPI_PLL_CTL0, 0xFFF, 0xFFE);
	hal_delay_us(1);
	cpu_read_modify_write(&dpi_dev_map->DPI_PLL_CTL1, 0x70000, 0x70000);
	hal_delay_us(1);

	/*Wait PLL ready*/
	while ((HAL_READ32(REG_SYS_DDRPHY_CTRL, 0x0) & 0x8) != 0x8);

	/*Enable PAD*/
	cpu_read_modify_write(REG_SYS_DDRPHY_CTRL, 0x2, 0x2);

	cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_2, 0x10C00000, 0x10C00000);
	cpu_read_modify_write(&dpi_dev_map->DPI_CRT_CTL, 0x0, 0x40800);
	cpu_read_modify_write(&dpi_dev_map->DPI_CRT_CTL, 0x0, 0x4);
	dpi_dev_map->DPI_CMD_ADR_PH = 0x7C055555;

