swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/source/ram/hal_dram_init.c
	cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_0, 0x1000, 0x203F00);
	dpi_dev_map->DPI_READ_CTRL_0_0 = 0x3;
	dpi_dev_map->DPI_READ_CTRL_0_1 = 0x3;
}

void hal_ddr3_phy_init(uint32_t dram_period_ps)
{
	DPI_TypeDef *dpi_dev_map = (DPI_TypeDef *) DPI_REG_BASE_ADDR;
	u32 rmw_data;

	hal_delay_us(1);
	cpu_read_modify_write(&dpi_dev_map->DPI_CRT_RST_CTL, 0x100, 0x100);

	hal_delay_us(1);
	cpu_read_modify_write(&dpi_dev_map->DPI_CRT_RST_CTL, 0x30, 0x30);

	dpi_dev_map->DPI_AFIFO_STR_0 = 0x22222222;

	cpu_read_modify_write(&dpi_dev_map->DPI_AFIFO_STR_1, 0x300000, 0x300000);

	cpu_read_modify_write(&dpi_dev_map->DPI_CRT_RST_CTL, 0x1, 0x1);

	rmw_data = dpi_dev_map->DPI_SSC1;
	rmw_data &= ~(DPI_MASK_GRAN_SET | DPI_MASK_DOT_GRAN);
	rmw_data |= (0x1CC | (0x4 << DPI_SHIFT_DOT_GRAN));
	dpi_dev_map->DPI_SSC1 = rmw_data;

	rmw_data = dpi_dev_map->DPI_SSC2;
	rmw_data &= ~(DPI_MASK_F_CODE | DPI_MASK_F_CODE_T);
	rmw_data |= (0x222 | (0x2AA << DPI_SHIFT_F_CODE_T));
	dpi_dev_map->DPI_SSC2 = rmw_data;

	rmw_data = dpi_dev_map->DPI_SSC3;
	rmw_data &= ~(DPI_MASK_N_CODE | DPI_MASK_N_CODE_T);
	rmw_data |= (0xA | (0xA << DPI_SHIFT_N_CODE_T));
	dpi_dev_map->DPI_SSC3 = rmw_data;

	//Set DCC/DLL
	cpu_read_modify_write(&dpi_dev_map->DPI_DCC_CMD, 0x3, 0x20000007);
	cpu_read_modify_write(&dpi_dev_map->DPI_DCC_CS, 0x3, 0x20000007);
	cpu_read_modify_write(&dpi_dev_map->DPI_DCC_CS1, 0x3, 0x20000007);
	cpu_read_modify_write(&dpi_dev_map->DPI_DCC_DQS_0, 0x3, 0x20000007);
	cpu_read_modify_write(&dpi_dev_map->DPI_DCC_DQS_1, 0x3, 0x20000007);
	cpu_read_modify_write(&dpi_dev_map->DPI_DCC_DQS_2, 0x3, 0x20000007);
	cpu_read_modify_write(&dpi_dev_map->DPI_DCC_DQS_3, 0x3, 0x20000007);
	cpu_read_modify_write(&dpi_dev_map->DPI_DCC_DQ_0, 0x3, 0x20000007);
	cpu_read_modify_write(&dpi_dev_map->DPI_DCC_DQ_1, 0x3, 0x20000007);
	cpu_read_modify_write(&dpi_dev_map->DPI_DCC_DQ_2, 0x3, 0x20000007);
	cpu_read_modify_write(&dpi_dev_map->DPI_DCC_DQ_3, 0x3, 0x20000007);
	cpu_read_modify_write(&dpi_dev_map->DPI_DCC_CK_0, 0x3, 0x20000007);
	cpu_read_modify_write(&dpi_dev_map->DPI_DCC_CK_1, 0x3, 0x20000007);

	cpu_read_modify_write(&dpi_dev_map->DPI_PLL_PI1, 0x80000, 0x1F0000);
	cpu_read_modify_write(&dpi_dev_map->DPI_PLL_PI2, 0x80808, 0x1F1F1F);
	hal_delay_us(10);

	cpu_read_modify_write(&dpi_dev_map->DPI_CRT_CTL, 0x80021, 0x080813F3);
	cpu_read_modify_write(&dpi_dev_map->DPI_CRT_CTL, 0x40000000, 0x40000000);
	hal_delay_us(1);
	cpu_read_modify_write(&dpi_dev_map->DPI_CRT_RST_CTL, 0x2, 0x2);

	hal_delay_us(100);

	cpu_read_modify_write(&dpi_dev_map->DPI_CRT_RST_CTL, 0x0, 0x8);
	cpu_read_modify_write(&dpi_dev_map->DPI_CRT_RST_CTL, 0xC, 0xC);
	hal_delay_us(1);

	cpu_read_modify_write(&dpi_dev_map->DPI_SSC3, 0x4000000, 0x4000000);
	cpu_read_modify_write(&dpi_dev_map->DPI_SSC3, 0x0, 0x4000000);
	cpu_read_modify_write(&dpi_dev_map->DPI_SSC0, 0xA, 0xA);

	cpu_read_modify_write(&dpi_dev_map->DPI_PLL_CTL1, 0x80000000, 0x80000000);
	hal_delay_us(1);

	rmw_data = dpi_dev_map->DPI_PLL_CTL3;
	rmw_data &= ~(DPI_MASK_ICP | DPI_MASK_LOOP_PI_ISEL | DPI_MASK_POST_PI_BIAS | DPI_MASK_POST_PI_RL);
	rmw_data |= (0x3 << DPI_SHIFT_ICP) | (0x3 << DPI_SHIFT_LOOP_PI_ISEL) | (0x1 << DPI_SHIFT_POST_PI_BIAS) | (0x1 << DPI_SHIFT_POST_PI_RL);
	dpi_dev_map->DPI_PLL_CTL3 = rmw_data;

	hal_delay_us(50);

	/*dfi_mck_slice_all*/
	cpu_read_modify_write(&dpi_dev_map->DPI_PLL_CTL0, 0x0, 0xFFE);
	hal_delay_us(1);
	cpu_read_modify_write(&dpi_dev_map->DPI_PLL_CTL1, 0x0, 0x20000);
	hal_delay_us(1);
	cpu_read_modify_write(&dpi_dev_map->DPI_PLL_CTL0, 0xFFF, 0xFFE);
	hal_delay_us(1);
	cpu_read_modify_write(&dpi_dev_map->DPI_PLL_CTL1, 0x70000, 0x70000);
	hal_delay_us(1);

	/*Wait PLL ready*/
	while ((HAL_READ32(REG_SYS_DDRPHY_CTRL, 0x0) & 0x8) != 0x8);

	/*Enable PAD*/
	cpu_read_modify_write(REG_SYS_DDRPHY_CTRL, 0x2, 0x2);

	cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_2, 0x10C00000, 0x10C00000);
	cpu_read_modify_write(&dpi_dev_map->DPI_CRT_CTL, 0x0, 0x40800);
	cpu_read_modify_write(&dpi_dev_map->DPI_CRT_CTL, 0x0, 0x4);
	dpi_dev_map->DPI_CMD_ADR_PH = 0x7C055555;

	cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_0, 0x1002, 0x203F03);
	dpi_dev_map->DPI_READ_CTRL_0_0 = 0x7;
	dpi_dev_map->DPI_READ_CTRL_0_1 = 0x7;
	dpi_dev_map->DPI_READ_CTRL1 = 0x4;
	cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_1, 0xC, 0xC);
}

#else
void hal_ddr2_phy_init(uint32_t dram_period_ps)
{
	DPI_TypeDef *dpi_dev_map = (DPI_TypeDef *) DPI_REG_BASE_ADDR;
	u32 ddr_freq = 1000000 / dram_period_ps;
	u32 freq;

	DBG_DRAM_INFO("ddr_freq = %d\r\n", ddr_freq);

	hal_delay_us(1);
	/*Release Bandgap reset*/
	dpi_dev_map->DPI_CRT_RST_CTL |= DPI_BIT_PLL_BG_RST_N;

	hal_delay_us(1);
	/*Release PLL LDO reset*/
	dpi_dev_map->DPI_CRT_RST_CTL |= DPI_BIT_PLL_LDO_RST_N;

	hal_delay_us(1);
	/*Enable PLL internal LDO*/
	dpi_dev_map->DPI_CRT_RST_CTL |= (DPI_BIT_POW_LDO_PLL | DPI_BIT_POW_LDO_V11);

	dpi_dev_map->DPI_AFIFO_STR_0 = 0x44444444;//533, CAS = 7
	cpu_read_modify_write(&dpi_dev_map->DPI_AFIFO_STR_1, 0x300043,
						  DPI_MASK_CMD_RD_STR_NUM | DPI_MASK_CMD_EX_RD_STR_NUM | DPI_BIT_BYPASS_EN_TX | DPI_BIT_BYPASS_EN_RX);
	cpu_read_modify_write(&dpi_dev_map->DPI_AFIFO_STR_2, 0x2222,
						  DPI_MASK_RX_RD_STR_NUM_0 | DPI_MASK_RX_RD_STR_NUM_1 | DPI_MASK_RX_RD_STR_NUM_2 | DPI_MASK_RX_RD_STR_NUM_3);//533, CAS = 7

	dram_init_clk_frequency(ddr_freq);

	//Set DCC/DLL
	cpu_read_modify_write(&dpi_dev_map->DPI_DCC_CMD, 0x3, DPI_MASK_DCC_CMD_DUTY_PRESETA | DPI_BIT_DCC_CMD_DUTY_SEL);
	cpu_read_modify_write(&dpi_dev_map->DPI_DCC_CS, 0x3, DPI_MASK_DCC_CMD_DUTY_PRESETA | DPI_BIT_DCC_CMD_DUTY_SEL);
	cpu_read_modify_write(&dpi_dev_map->DPI_DCC_DQS_0, 0x3, DPI_MASK_DCC_CMD_DUTY_PRESETA | DPI_BIT_DCC_CMD_DUTY_SEL);
	cpu_read_modify_write(&dpi_dev_map->DPI_DCC_DQS_1, 0x3, DPI_MASK_DCC_CMD_DUTY_PRESETA | DPI_BIT_DCC_CMD_DUTY_SEL);
	cpu_read_modify_write(&dpi_dev_map->DPI_DCC_DQ_0, 0x3, DPI_MASK_DCC_CMD_DUTY_PRESETA | DPI_BIT_DCC_CMD_DUTY_SEL);
	cpu_read_modify_write(&dpi_dev_map->DPI_DCC_DQ_1, 0x3, DPI_MASK_DCC_CMD_DUTY_PRESETA | DPI_BIT_DCC_CMD_DUTY_SEL);
	cpu_read_modify_write(&dpi_dev_map->DPI_DCC_CK_0, 0x3, DPI_MASK_DCC_CMD_DUTY_PRESETA | DPI_BIT_DCC_CMD_DUTY_SEL);

	cpu_read_modify_write(&dpi_dev_map->DPI_PLL_PI1, 0x80000, 0x1F0000);
	cpu_read_modify_write(&dpi_dev_map->DPI_PLL_PI2, 0x80808, 0x1F1F1F);
	hal_delay_us(10);

