swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/source/ram/hal_dram_init.c
	cpu_read_modify_write(&dpi_dev_map->DPI_CRT_CTL, 0x102, 0x08080132);

	dpi_dev_map->DPI_CRT_CTL |= DPI_BIT_MCK_CKE_SEL;
	hal_delay_us(1);

	dpi_dev_map->DPI_CRT_RST_CTL |= DPI_BIT_PLL_SSC_DIG_RST_N;
	hal_delay_us(100);

	dpi_dev_map->DPI_CRT_RST_CTL &= ~DPI_BIT_PTR_RST_N;
	dpi_dev_map->DPI_CRT_RST_CTL |= (DPI_BIT_PTR_RST_N | DPI_BIT_RST_N);
	hal_delay_us(1);

	dpi_dev_map->DPI_PLL_CTL1 |= DPI_BIT_MCK_MC_EN;
	hal_delay_us(1);

	if (ddr_freq == 533) {
		freq = 0;
	} else if (ddr_freq == 400) {
		freq = 1;
	} else if (ddr_freq == 333) {
		freq = 2;
	} else if (ddr_freq == 200) {
		freq = 3;
	} else if (ddr_freq == 480) {
		freq = 4;
	} else {
		freq = 5;
	}

	dram_set_pll_frequency(&pll_frequence_table[freq][0]);

	hal_delay_us(50);

	/*dfi_mck_slice_all*/
	//cpu_read_modify_write(&dpi_dev_map->DPI_PLL_CTL0, 0x0, 0xFFE);
	cpu_read_modify_write(&dpi_dev_map->DPI_PLL_CTL0, 0x0, DPI_MASK_MCK_CLK_EN);
	hal_delay_us(1);

	//cpu_read_modify_write(&dpi_dev_map->DPI_PLL_CTL1, 0x0, 0x20000);
	cpu_read_modify_write(&dpi_dev_map->DPI_PLL_CTL1, 0x0, DPI_MASK_CLK_OE);
	hal_delay_us(1);

	//cpu_read_modify_write(&dpi_dev_map->DPI_PLL_CTL0, 0xFFF, 0xFFE);
	cpu_read_modify_write(&dpi_dev_map->DPI_PLL_CTL0, 0xFFF, DPI_MASK_MCK_CLK_EN);
	hal_delay_us(1);

	//cpu_read_modify_write(&dpi_dev_map->DPI_PLL_CTL1, 0x70000, 0x70000);
	cpu_read_modify_write(&dpi_dev_map->DPI_PLL_CTL1, 0x7 << DPI_SHIFT_CLK_OE, DPI_MASK_CLK_OE);
	hal_delay_us(1);

	/*Wait PLL ready*/
	while ((HAL_READ32(REG_SYS_DDRPHY_CTRL, 0x0) & 0x8) != 0x8);

	/*Enable PAD*/
	cpu_read_modify_write((volatile uint32_t *)REG_SYS_DDRPHY_CTRL, 0x2, 0x2);

	dram_r480_calibration(DDR_2);
	dram_zq_calibration(DDR_2);

	dpi_dev_map->DPI_DQ_ODT_SEL_0 = 0xFFFF4444;
	dpi_dev_map->DPI_DQ_ODT_SEL_1 = 0xFFFF4444;
	dpi_dev_map->DPI_DQ_OCD_SEL_0 = 0xFFFF0000;
	dpi_dev_map->DPI_DQ_OCD_SEL_1 = 0xFFFF0000;
	dpi_dev_map->DPI_DQS_P_ODT_SEL_0 = 0xffff0011;
	dpi_dev_map->DPI_DQS_P_ODT_SEL_1 = 0xffff0011;
	dpi_dev_map->DPI_DQS_N_ODT_SEL_0 = 0xffff1100;
	dpi_dev_map->DPI_DQS_N_ODT_SEL_1 = 0xffff1100;
	dpi_dev_map->DPI_DQS_OCD_SEL_0 = 0x0;
	dpi_dev_map->DPI_DQS_OCD_SEL_1 = 0x0;
	dpi_dev_map->DPI_CKE_OCD_SEL = 0xffff3333;
	dpi_dev_map->DPI_ADR_OCD_SEL = 0x33ff33ff;
	dpi_dev_map->DPI_CK_OCD_SEL = 0x55555555;
	dpi_dev_map->DPI_OCD_SEL_0 = 0x22222222;
	dpi_dev_map->DPI_OCD_SEL_1 = 0x22222222;
	dpi_dev_map->DPI_OCD_SEL_2 = 0x22222222;
	dpi_dev_map->DPI_OCD_SEL_3 = 0x22222222;
	dpi_dev_map->DPI_OCD_SEL_4 = 0x22222222;
	dpi_dev_map->DPI_OCD_SEL_5 = 0x22222222;
	dpi_dev_map->DPI_OCD_SEL_6 = 0x22222222;
	dpi_dev_map->DPI_OCD_SEL_7 = 0x22222222;
	dpi_dev_map->DPI_OCD_SEL_8 = 0x22222222;
	dpi_dev_map->DPI_ODT_SEL_0 = 0xffffff33;
	dpi_dev_map->DPI_CKE_ODT_SEL = 0xffff2222;
	dpi_dev_map->DPI_ADR_ODT_SEL = 0x22ff2277;
	dpi_dev_map->DPI_CLK_ODT_SEL = 0x00003333;

	cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_2, 0x10C00000, 0x10C00000);
	cpu_read_modify_write(&dpi_dev_map->DPI_CRT_CTL, 0x0, 0x40800);
	cpu_read_modify_write(&dpi_dev_map->DPI_CRT_CTL, 0x0, 0x4);

	/*Update immediately*/
	cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_0, 0x2 << DPI_SHIFT_FW_SET_MODE, DPI_MASK_FW_SET_MODE);////CHUN-CHI
	dpi_dev_map->DPI_CMD_ADR_PH = 0x7C055555;

	dpi_dev_map->DPI_DQ_IO_CTL_1 &= ~DPI_BIT_DM_IE_FRC_EN;
	dpi_dev_map->DPI_DQ_IO_CTL_1_1 &= ~DPI_BIT_DM_IE_FRC_EN;

	cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_0, 0x1000, 0x303F00);
	cpu_read_modify_write(&dpi_dev_map->DPI_READ_CTRL_0_0, 0x7 << DPI_SHIFT_TM_DQS_EN_FTUN, DPI_MASK_TM_DQS_EN_FTUN | DPI_MASK_TM_DQS_EN);////CHUN-CHI
	cpu_read_modify_write(&dpi_dev_map->DPI_READ_CTRL_0_1, 0x7 << DPI_SHIFT_TM_DQS_EN_FTUN, DPI_MASK_TM_DQS_EN_FTUN | DPI_MASK_TM_DQS_EN);////CHUN-CHI
	cpu_read_modify_write(&dpi_dev_map->DPI_READ_CTRL1, 0x6 << DPI_SHIFT_TM_RD_FIFO, DPI_MASK_TM_RD_FIFO);//533, CAS = 7

	/*DCK*/
	cpu_read_modify_write(&dpi_dev_map->DPI_PLL_PI0, 0x17 << DPI_SHIFT_POST_PI_SEL0, DPI_MASK_POST_PI_SEL0);
	dpi_dev_map->DPI_PLL_CTL1 |= (1 << 0);

	/*DCS*/
	cpu_read_modify_write(&dpi_dev_map->DPI_PLL_PI2, 0x1F << DPI_SHIFT_POST_PI_SEL10, DPI_MASK_POST_PI_SEL10);
	dpi_dev_map->DPI_PLL_CTL1 |= (1 << 10);

	/*DQS0, DQS1*/
	cpu_read_modify_write(&dpi_dev_map->DPI_PLL_PI0, 0x1D << DPI_SHIFT_POST_PI_SEL2, DPI_MASK_POST_PI_SEL2);
	//cpu_read_modify_write(&dpi_dev_map->DPI_AFIFO_STR_0, 0x2 << DPI_SHIFT_DQS_RD_STR_NUM_0, DPI_MASK_DQS_RD_STR_NUM_0);//480, CAS = 4
	cpu_read_modify_write(&dpi_dev_map->DPI_AFIFO_STR_0, 0x3 << DPI_SHIFT_DQS_RD_STR_NUM_0, DPI_MASK_DQS_RD_STR_NUM_0);//533, CAS = 7
	cpu_read_modify_write(&dpi_dev_map->DPI_PLL_PI0, 0x1D << DPI_SHIFT_POST_PI_SEL3, DPI_MASK_POST_PI_SEL3);
	//cpu_read_modify_write(&dpi_dev_map->DPI_AFIFO_STR_0, 0x2 << DPI_SHIFT_DQS_RD_STR_NUM_1, DPI_MASK_DQS_RD_STR_NUM_1);//480, CAS = 4
	cpu_read_modify_write(&dpi_dev_map->DPI_AFIFO_STR_0, 0x3 << DPI_SHIFT_DQS_RD_STR_NUM_1, DPI_MASK_DQS_RD_STR_NUM_1);//533, CAS = 7

	/*If pi value is 0 ~ 15, oesync = 0, if pi value is 16 ~ 31, oesync = 1*/
	dpi_dev_map->DPI_PLL_CTL1 |= (1 << 2);
	dpi_dev_map->DPI_PLL_CTL1 |= (1 << 3);

	/*DQ0, DQ1*/
	cpu_read_modify_write(&dpi_dev_map->DPI_PLL_PI1, 0x5 << DPI_SHIFT_POST_PI_SEL6, DPI_MASK_POST_PI_SEL6);
	cpu_read_modify_write(&dpi_dev_map->DPI_PLL_PI2, 0x6 << DPI_SHIFT_POST_PI_SEL7, DPI_MASK_POST_PI_SEL7);

	/*DQ DLY*/
	dpi_dev_map->DPI_DQ_DLY_0 = 0x88888888;
	dpi_dev_map->DPI_DQ_DLY_0_1 = 0x88888888;
	dpi_dev_map->DPI_DQ_DLY_1 = 0x888;
	dpi_dev_map->DPI_DQ_DLY_1_1 = 0x888;

	/*FW set write delay chain of data slice*/
	dpi_dev_map->DPI_DPI_CTRL_1 |= (DPI_BIT_FW_SET_WR_DLY | DPI_BIT_WRITE_EN_0);

	/*FW set read delay chain of data slice*/
	dpi_dev_map->DPI_DPI_CTRL_1 |= (DPI_BIT_FW_SET_RD_DLY | DPI_BIT_WRITE_EN_1);

	cpu_read_modify_write(&dpi_dev_map->DPI_READ_CTRL_0_0, 0x9 << DPI_SHIFT_DQS_RC1IN_DLY_SEL, DPI_MASK_DQS_RC1IN_DLY_SEL);
	cpu_read_modify_write(&dpi_dev_map->DPI_READ_CTRL_0_1, 0xC << DPI_SHIFT_DQS_RC1IN_DLY_SEL, DPI_MASK_DQS_RC1IN_DLY_SEL);

	/*Pick the center point of available windows*/
	dpi_dev_map->DPI_DQS_IN_DLY0 = 0x10101010;
	dpi_dev_map->DPI_DQS_IN_DLY0_1 = 0x10101010;

	dpi_dev_map->DPI_DQS_IN_DLY1 = 0x10101010;
	dpi_dev_map->DPI_DQS_IN_DLY1_1 = 0x10101010;

