swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/source/ram/hal_dram_init.c
	/*FW set read delay chain of data slice*/
	dpi_dev_map->DPI_DPI_CTRL_1 |= (DPI_BIT_FW_SET_RD_DLY | DPI_BIT_WRITE_EN_1);

	cpu_read_modify_write(&dpi_dev_map->DPI_READ_CTRL_0_0, 0x8 << DPI_SHIFT_DQS_RC1IN_DLY_SEL, DPI_MASK_DQS_RC1IN_DLY_SEL);
	cpu_read_modify_write(&dpi_dev_map->DPI_READ_CTRL_0_1, 0x9 << DPI_SHIFT_DQS_RC1IN_DLY_SEL, DPI_MASK_DQS_RC1IN_DLY_SEL);

	/*Pick the center point of available windows*/
	dpi_dev_map->DPI_DQS_IN_DLY0 = 0x10101010;
	dpi_dev_map->DPI_DQS_IN_DLY0_1 = 0x10101010;

	dpi_dev_map->DPI_DQS_IN_DLY1 = 0x10101010;
	dpi_dev_map->DPI_DQS_IN_DLY1_1 = 0x10101010;

	dpi_dev_map->DPI_DQS_IN_DLY2 = 0x10101010;
	dpi_dev_map->DPI_DQS_IN_DLY2_1 = 0x10101010;

	dpi_dev_map->DPI_DQS_IN_DLY3 = 0x10101010;
	dpi_dev_map->DPI_DQS_IN_DLY3_1 = 0x10101010;

	dpi_dev_map->DPI_DPI_CTRL_1 |= (DPI_BIT_FW_SET_RD_DLY | DPI_BIT_WRITE_EN_1);
	cpu_read_modify_write(&dpi_dev_map->DPI_DPI_CTRL_0, 0x0 << DPI_SHIFT_FW_SET_MODE, DPI_MASK_FW_SET_MODE);
}

#endif

void hal_init_dram()
{
	u32 chip_id = 0;
	u8 dram_type = 0;
	DRAMC_TypeDef *dramc_dev = (DRAMC_TypeDef *) DRAMC_CTRL_BASE_ADDR;
	DRAM_FE_TypeDef *dram_ft_dev = (DRAM_FE_TypeDef *) DRAMC_FRONTEND_BASE_ADDR;
	SYSON_S_TypeDef *syson_s = SYSON_S;

	/*Enable clock & function, PAD is not enabled yet*/
	syson_s->SYSON_S_REG_SYS_LPDDR1_CTRL = SYSON_S_BIT_HS_LPDDR1_EN | SYSON_S_BIT_HS_LPDDR1_CLK_EN;
	syson_s->SYSON_S_REG_SYS_DDRPHY_CTRL = SYSON_S_BIT_HS_DDRPHY_CRT_RST | SYSON_S_BIT_DDRPHY_RBUS_EN | SYSON_S_BIT_DDRPHY_VCCON | SYSON_S_BIT_HS_DDRPHY_RBUS_CLK_EN
										   | SYSON_S_BIT_HS_DDRPHY_CRT_CLK_EN;

#if CONFIG_PXP || SIMU_DDR_PXP_INIT_FLOW_EN // PXP , asic simu run flow
#if DRAM_TYPE_DDR2
	dbg_printf("DRAM_TYPE is DDR2.\r\n");
	dram_type = DDR_2;
#else
	dbg_printf("DRAM_TYPE is DDR3L.\r\n");
	dram_type = DDR_3;
#endif
#else
	hal_sys_get_chip_id(&chip_id);
	if (((chip_id >> 16) & 0x3) == 0x3) {
		dbg_printf("DRAM_TYPE is DDR2.\r\n");
		dram_type = DDR_2;
	} else {
		dbg_printf("DRAM_TYPE is DDR3L.\r\n");
		dram_type = DDR_3;
	}
#endif

	if (dram_type == DDR_2) {
		hal_ddr2_phy_init(1000000 / 533);

		hal_dramc_perf_tune(dramc_dev, &rxi316_ddr2_info_m);

		hal_dramc_init(dramc_dev, &rxi316_ddr2_info_m);
	} else {
		hal_ddr3_phy_init(1000000 / 533);

		hal_dramc_perf_tune(dramc_dev, &rxi316_ddr3_info_m);

		hal_dramc_init(dramc_dev, &rxi316_ddr3_info_m);
	}

	hal_dramc_ftend_init(dram_ft_dev);
}


